HolgerBurkarth/HomeKit-ESP8266/src/arduino_homekit_server.cpp
#pragma region Prolog
/*******************************************************************
$CRT 16 Sep 2024 : hb

$AUT Holger Burkarth
$DAT >>arduino_homekit_server.cpp<< 08 Okt 2024  09:39:31 - (c) proDAD
*******************************************************************/
#pragma endregion
#pragma region Spelling
// Ignore Spelling: maxpkt fds pw ev aa chacha preinit valueint admins gw ack arcdegrees 
#pragma endregion
#pragma region Includes

//#define HOMEKIT_DEBUG 1

#include <Arduino.h>
#include <esp_xpgm.h>
#include <ESP8266WiFi.h>
#include <WiFiServer.h>
#include <WiFiClient.h>
#include <ESP8266mDNS.h>
#include <LEAmDNS.h>

#include <wolfssl/wolfcrypt/settings.h>
#include <homekit/homekit.h>
#include <homekit/characteristics.h>
#include <homekit/tlv.h>
#include <homekit/types.h>
#include <wolfssl/wolfcrypt/hash.h> //wc_sha512

#include "constants.h"
#include "base64.h"
#include "pairing.h"
#include "storage.h"
#include "query_params.h"
#include "json.h"
#include "homekit_debug.h"
#include "port.h"
#include "http_parser.h"
#include "query_params.h"
#include "cJSON.h"
#include "cQueue.h"
#include "crypto.h"
#include "watchdog.h"
#include "arduino_homekit_server.h"
#include "hb_homekit.h"

#pragma endregion
#pragma region HAP Info (Apple)
/*
 * You are recommended to read the Apple's HAP doc before using this library.
 * https://developer.apple.com/apple-home/
 * https://developer.apple.com/documentation/homekit
 *
 * HAP
 * https://github.com/apple/HomeKitADK/blob/master/HAP/HAPCharacteristicTypes.h
 * https://github.com/apple/HomeKitADK/blob/master/HAP/HAPServiceTypes.h
 *
 * https://github.com/brutella/hap/tree/master/service
 *
 */
#pragma endregion
#pragma region Defines
#define HOMEKIT_SERVER_PORT      5556
#define HOMEKIT_MAX_CLIENTS      8
#define HOMEKIT_MDNS_SERVICE     "hap"//"_hap"
#define HOMEKIT_MDNS_PROTO       "tcp"//"_tcp"
#define HOMEKIT_EVENT_QUEUE_SIZE 4 //original is 20
//#define HOMEKIT_SOCKET_TIMEOUT   500 //milliseconds
#define HOMEKIT_SOCKET_TIMEOUT   5000 //milliseconds

//#define TCP_DEFAULT_KEEPALIVE_IDLE_SEC          7200 // 2 hours
//#define TCP_DEFAULT_KEEPALIVE_INTERVAL_SEC      75   // 75 sec
//#define TCP_DEFAULT_KEEPALIVE_COUNT             9    // fault after 9 failures
//const int idle = 180; /* 180 sec idle before start sending probes */
#define HOMEKIT_SOCKET_KEEPALIVE_IDLE_SEC      180
//const int interval = 30; /* 30 sec between probes */
#define HOMEKIT_SOCKET_KEEPALIVE_INTERVAL_SEC  30
//const int maxpkt = 4; /* Drop connection after 4 probes without response */
#define HOMEKIT_SOCKET_KEEPALIVE_IDLE_COUNT     4
// if 180 + 30 * 4 = 300 sec without socket response, disconnected it.

// WiFiClient can not write big buff once.
// TCP_SND_BUF = (2 * TCP_MSS) = 1072. See lwipopts.h
// max(encrypted_chunk) = 512 + 8(chunk_info) + 18(chacha_info). See client_send_encrypted
#define HOMEKIT_JSONBUFFER_SIZE  512

#ifdef HOMEKIT_DEBUG
#define TLV_DEBUG(values) //tlv_debug(values)
#else
#define TLV_DEBUG(values)
#endif

#define CLIENT_DEBUG(client, message, ...)  DEBUG("[Client %d] " message, client->socket, ##__VA_ARGS__)
#define CLIENT_VERBOSE(client, message, ...)VERBOSE(message, ##__VA_ARGS__)
#define CLIENT_ERROR(client, message, ...)  ERROR("[Client %d] " message, client->socket, ##__VA_ARGS__)
//#define CLIENT_INFO(client, message, ...)   INFO("[Client %d] " message, client->socket, ##__VA_ARGS__)
#define CLIENT_INFO(client, message, ...)   INFO(message, ##__VA_ARGS__)

#define HOMEKIT_NOTIFY_EVENT(server, event) \
  if((server)->config->on_event) (server)->config->on_event(event);


#pragma endregion

#pragma region +Protocols

#pragma region Starting unpaired device
/* Starting unpaired device:

Info		WiFi connected, IP: 192.168.3.76
Warn	2024-10-04 06:03:13	ESP Restart Reason: Software/System restart
>>> server_new: WiFiServer begin at port: 5556
    Starting server
Info	2024-10-04 06:03:13	Resetting HomeKit storage
Info	2024-10-04 06:03:13	Formatting HomeKit storage at 0x3fb000
Info	2024-10-04 06:03:13	Generated new accessory ID: E8:39:B2:7D:9D:A6
Info	2024-10-04 06:03:13	Generated new accessory key
Info	2024-10-04 06:03:13	Preinitializing pairing context
>>> arduino_homekit_preinit: Free heap: 28616
Info	2024-10-04 06:03:13	Using user-specified password: 111-11-111
Info	2024-10-04 06:03:13	Call s_mp_exptmod in integer.c, original winsize 6
Info	2024-10-04 06:03:26	Call s_mp_exptmod in integer.c, original winsize 5
Info	2024-10-04 06:03:33	Preinitialize pairing context success
    Configuring MDNS
Info	2024-10-04 06:03:33	MDNS begin: http://Sensor.local, IP: 192.168.3.76
    Init server done
    Web-Server started
    Free heap: 23520 bytes
Info	2024-10-04 06:03:33	Setup finished
>>> operator(): MDNS call DynamicServiceTxtCallback
>>> operator(): MDNS call DynamicServiceTxtCallback
>>> operator(): MDNS call DynamicServiceTxtCallback
...
*/

#pragma endregion

#pragma region Pairing failed
/* Pairing failed ...

Info		WiFi connected, IP: 192.168.3.76
Warn	2024-10-04 06:45:53	ESP Restart Reason: Software/System restart
    Starting server
Info	2024-10-04 06:45:53	Resetting HomeKit storage
Info	2024-10-04 06:45:53	Formatting HomeKit storage at 0x3fb000
Info	2024-10-04 06:45:53	Generated new accessory ID: 95:05:4E:5E:05:38
Info	2024-10-04 06:45:53	Generated new accessory key
Info	2024-10-04 06:45:53	Preinitializing pairing context
Info	2024-10-04 06:45:53	Using user-specified password: 111-11-111
Info	2024-10-04 06:45:53	Call s_mp_exptmod in integer.c, original winsize 6
Info	2024-10-04 06:46:06	Call s_mp_exptmod in integer.c, original winsize 5
Info	2024-10-04 06:46:13	Preinitialize pairing context success
    Configuring MDNS
Info	2024-10-04 06:46:13	MDNS begin: http://Sensor.local, IP: 192.168.3.76
    Init server done
    Web-Server started
    Free heap: 24160 bytes
Info	2024-10-04 06:46:13	Setup finished
Info	2024-10-04 06:46:29	Got new client: local 192.168.3.76:5556, remote 192.168.3.28:63808
    Enter LockWebServer

Info	2024-10-04 06:46:29	Pair Setup Step 1/3
Info	2024-10-04 06:46:32	Pair Setup Step 2/3
Info	2024-10-04 06:46:32	Call s_mp_exptmod in integer.c, original winsize 6
Info	2024-10-04 06:46:52	Call s_mp_exptmod in integer.c, original winsize 5
Error	2024-10-04 06:47:01	[Client 1073703196] The socket is null! (or is closed)
Info	2024-10-04 06:47:01	Disconnected!
Info	2024-10-04 06:47:01	Closing client connection
    Leave LockWebServer

    Free saved_preinit_pairing_context
Info	2024-10-04 06:47:01	Clear the pairing context
Info	2024-10-04 06:47:01	Preinitializing pairing context
Info	2024-10-04 06:47:01	Using user-specified password: 111-11-111
Info	2024-10-04 06:47:01	Call s_mp_exptmod in integer.c, original winsize 6
Info	2024-10-04 06:47:14	Call s_mp_exptmod in integer.c, original winsize 5
Info	2024-10-04 06:47:21	Preinitialize pairing context success
*/

#pragma endregion

#pragma region (Debug) Pairing
/* (Debug) Pairing ...

Info	2024-10-04 06:06:19	Got new client: local 192.168.3.76:5556, remote 192.168.3.28:63797
>>> homekit_client_process: [Client 1073702916] Got 124 incoming data, encrypted is false
>>> homekit_server_on_body: http_parser length=6
>>> homekit_server_on_message_complete: http_parser message_complete
>>> homekit_server_on_pair_setup: Pair Setup
>>> homekit_server_on_pair_setup: Free heap: 20984
Info	2024-10-04 06:06:19	Pair Setup Step 1/3
>>> homekit_server_on_pair_setup: Free heap: 20912
>>> send_tlv_response: [Client 1073702916] Sending TLV response
>>> client_send: [Client 1073702916] send data size=513, encrypted=false
>>> write: [Client 1073702916] Sending data of size 513
### [ 191917] pair_setup took     28ms
>>> homekit_client_process: [Client 1073702916] Finished processing
>>> homekit_client_process: [Client 1073702916] Got 577 incoming data, encrypted is false
>>> homekit_server_on_body: http_parser length=457
>>> homekit_server_on_message_complete: http_parser message_complete
>>> homekit_server_on_pair_setup: Pair Setup
>>> homekit_server_on_pair_setup: Free heap: 20312
Info	2024-10-04 06:06:24	Pair Setup Step 2/3
>>> homekit_server_on_pair_setup: Free heap: 19872
>>> homekit_server_on_pair_setup: [Client 1073702916] Computing SRP shared secret
>>> homekit_server_on_pair_setup: Free heap: 19872
Info	2024-10-04 06:06:24	Call s_mp_exptmod in integer.c, original winsize 6
Info	2024-10-04 06:06:43	Call s_mp_exptmod in integer.c, original winsize 5
>>> homekit_server_on_pair_setup: [Client 1073702916] Verifying peer's proof
>>> homekit_server_on_pair_setup: [Client 1073702916] Generating own proof
>>> send_tlv_response: [Client 1073702916] Sending TLV response
>>> client_send: [Client 1073702916] send data size=172, encrypted=false
>>> write: [Client 1073702916] Sending data of size 172
### [ 224695] pair_setup took  28581ms
Info	2024-10-04 06:06:43	Call s_mp_exptmod in integer.c, original winsize 5
>>> homekit_server_on_pair_setup: [Client 1073702916] Verifying peer's proof
>>> homekit_server_on_pair_setup: [Client 1073702916] Generating own proof
>>> send_tlv_response: [Client 1073702916] Sending TLV response
>>> client_send: [Client 1073702916] send data size=172, encrypted=false
>>> write: [Client 1073702916] Sending data of size 172
### [ 224695] pair_setup took  28581ms
>>> homekit_client_process: [Client 1073702916] Finished processing
>>> homekit_client_process: [Client 1073702916] Got 279 incoming data, encrypted is false
>>> homekit_server_on_body: http_parser length=159
>>> homekit_server_on_message_complete: http_parser message_complete
>>> homekit_server_on_pair_setup: Pair Setup
>>> homekit_server_on_pair_setup: Free heap: 21152
Info	2024-10-04 06:06:52	Pair Setup Step 3/3
>>> homekit_server_on_pair_setup: Free heap: 20928
>>> homekit_server_on_pair_setup: [Client 1073702916] Calculating shared secret
>>> homekit_server_on_pair_setup: [Client 1073702916] Decrypting payload
>>> homekit_server_on_pair_setup: [Client 1073702916] Importing device public key
>>> homekit_server_on_pair_setup: [Client 1073702916] Calculating DeviceX
>>> homekit_server_on_pair_setup: [Client 1073702916] Verifying device signature
Info	2024-10-04 06:06:53	Call ge_double_scalarmult_vartime_lowmem in ge_low_mem.c
    Added pairing with 5E409937-DEAA-4A6C-B1B2-F2B85E602F50
>>> homekit_server_on_pair_setup: [Client 1073702916] Exporting accessory public key
>>> homekit_server_on_pair_setup: [Client 1073702916] Calculating AccessoryX
>>> homekit_server_on_pair_setup: [Client 1073702916] Generating accessory signature
>>> homekit_server_on_pair_setup: Free heap: 18200
>>> homekit_server_on_pair_setup: [Client 1073702916] Encrypting response
>>> send_tlv_response: [Client 1073702916] Sending TLV response
>>> client_send: [Client 1073702916] send data size=244, encrypted=false
>>> write: [Client 1073702916] Sending data of size 244
    Free saved_preinit_pairing_context
Info	2024-10-04 06:06:54	Successfully paired
### [ 226516] pair_setup took   1670ms
>>> homekit_client_process: [Client 1073702916] Finished processing

Info	2024-10-04 06:06:54	Disconnected!
Info	2024-10-04 06:06:54	Closing client connection
>>> homekit_server_close_client: [Client 1073702916] The socket is stopped



