HolgerBurkarth/HomeKit-ESP8266/src/arduino_homekit_server.cpp
Info	2024-10-04 06:06:54	Got new client: local 192.168.3.76:5556, remote 192.168.3.28:63798
>>> homekit_client_process: [Client 1073706356] Got 157 incoming data, encrypted is false
>>> homekit_server_on_body: http_parser length=37
>>> homekit_server_on_message_complete: http_parser message_complete
>>> homekit_server_on_pair_verify: HomeKit Pair Verify
>>> homekit_server_on_pair_verify: Free heap: 22704
Info	2024-10-04 06:06:54	Pair Verify Step 1/2
>>> homekit_server_on_pair_verify: [Client 1073706356] Importing device Curve25519 public key
>>> homekit_server_on_pair_verify: [Client 1073706356] Generating accessory Curve25519 key
>>> homekit_server_on_pair_verify: [Client 1073706356] Exporting accessory Curve25519 public key
>>> homekit_server_on_pair_verify: [Client 1073706356] Generating Curve25519 shared secret
>>> homekit_server_on_pair_verify: [Client 1073706356] Generating signature
>>> homekit_server_on_pair_verify: [Client 1073706356] Generating proof
>>> homekit_server_on_pair_verify: [Client 1073706356] Encrypting response
>>> send_tlv_response: [Client 1073706356] Sending TLV response
>>> client_send: [Client 1073706356] send data size=244, encrypted=false
>>> write: [Client 1073706356] Sending data of size 244
### [ 227475] pair_verify took    562ms
    Free heap: 21832
>>> homekit_client_process: [Client 1073706356] Finished processing
>>> homekit_client_process: [Client 1073706356] Got 246 incoming data, encrypted is false
>>> homekit_server_on_body: http_parser length=125
>>> homekit_server_on_message_complete: http_parser message_complete
>>> homekit_server_on_pair_verify: HomeKit Pair Verify
>>> homekit_server_on_pair_verify: Free heap: 22416
Info	2024-10-04 06:06:55	Pair Verify Step 2/2
>>> homekit_server_on_pair_verify: [Client 1073706356] Decrypting payload
>>> homekit_server_on_pair_verify: [Client 1073706356] Searching pairing with 5E409937-DEAA-4A6C-B1B2-F2B85E602F50
Info	2024-10-04 06:06:55	Found pairing with 5E409937-DEAA-4A6C-B1B2-F2B85E602F50
>>> homekit_server_on_pair_verify: [Client 1073706356] Verifying device signature
Info	2024-10-04 06:06:55	Call ge_double_scalarmult_vartime_lowmem in ge_low_mem.c
>>> send_tlv_response: [Client 1073706356] Sending TLV response
>>> client_send: [Client 1073706356] send data size=105, encrypted=false
>>> write: [Client 1073706356] Sending data of size 105
Info	2024-10-04 06:06:57	Verification successful, secure session established
### [ 229140] pair_verify took   1522ms
    Free heap: 21608
>>> homekit_client_process: [Client 1073706356] Finished processing
>>> homekit_client_process: [Client 1073706356] Got 77 incoming data, encrypted is true
>>> homekit_client_process: [Client 1073706356] Decrypting data
>>> homekit_client_process: [Client 1073706356] Decrypted 59 bytes, available 0
>>> homekit_server_on_message_complete: http_parser message_complete
Info	2024-10-04 06:06:57	Get Accessories
>>> homekit_server_on_get_accessories: Free heap: 22496
>>> client_send: [Client 1073706356] send data size=107, encrypted=true
>>> client_send_encrypted_: [Client 1073706356] Send encrypted of size 107
>>> write: [Client 1073706356] Sending data of size 125
>>> homekit_server_on_get_accessories: [Client 1073706356] Get Accessories, start send json body
>>> client_send_chunk: [Client 1073706356] client_send_chunk, size=508, offset=5
>>> client_send: [Client 1073706356] send data size=515, encrypted=true
>>> client_send_encrypted_: [Client 1073706356] Send encrypted of size 515
>>> write: [Client 1073706356] Sending data of size 533
>>> client_send_chunk: [Client 1073706356] client_send_chunk, size=508, offset=5
>>> client_send: [Client 1073706356] send data size=515, encrypted=true
>>> client_send_encrypted_: [Client 1073706356] Send encrypted of size 515
>>> write: [Client 1073706356] Sending data of size 533
>>> client_send_chunk: [Client 1073706356] client_send_chunk, size=107, offset=4
>>> client_send: [Client 1073706356] send data size=113, encrypted=true
>>> client_send_encrypted_: [Client 1073706356] Send encrypted of size 113
>>> write: [Client 1073706356] Sending data of size 131
>>> client_send_chunk: [Client 1073706356] client_send_chunk, size=0, offset=3
>>> client_send: [Client 1073706356] send data size=5, encrypted=true
>>> client_send_encrypted_: [Client 1073706356] Send encrypted of size 5
>>> write: [Client 1073706356] Sending data of size 23
### [ 229524] get_accessories took    190ms
>>> homekit_client_process: [Client 1073706356] Finished processing
>>> homekit_client_process: [Client 1073706356] Got 187 incoming data, encrypted is true
>>> homekit_client_process: [Client 1073706356] Decrypting data
>>> homekit_client_process: [Client 1073706356] Decrypted 169 bytes, available 0
>>> homekit_server_on_body: http_parser length=50
>>> homekit_server_on_message_complete: http_parser message_complete
Info	2024-10-04 06:06:58	Update Characteristics
>>> homekit_server_on_update_characteristics: Free heap: 22040
>>> homekit_server_on_update_characteristics: [Client 1073706356] Processing element {
  "aid":	1,
  "iid":	10,
  "ev":	true
}
>>> homekit_server_on_update_characteristics: [Client 1073706356] There were no processing errors, sending No Content response
>>> client_send: [Client 1073706356] send data size=27, encrypted=true
>>> client_send_encrypted_: [Client 1073706356] Send encrypted of size 27
>>> write: [Client 1073706356] Sending data of size 45
### [ 230799] update_characteristics took     56ms
>>> homekit_client_process: [Client 1073706356] Finished processing
>>> homekit_client_process: [Client 1073706356] Got 92 incoming data, encrypted is true
>>> homekit_client_process: [Client 1073706356] Decrypting data
>>> homekit_client_process: [Client 1073706356] Decrypted 74 bytes, available 0
>>> homekit_server_on_message_complete: http_parser message_complete
Info	2024-10-04 06:06:58	Get Characteristics
>>> homekit_server_on_get_characteristics: Free heap: 22136
>>> homekit_server_on_get_characteristics: [Client 1073706356] Query parameter id = 1.7,1.5
>>> homekit_server_on_get_characteristics: [Client 1073706356] Requested characteristic info for 1.7
>>> homekit_server_on_get_characteristics: [Client 1073706356] Requested characteristic info for 1.5
>>> client_send: [Client 1073706356] send data size=107, encrypted=true
>>> client_send_encrypted_: [Client 1073706356] Send encrypted of size 107
>>> write: [Client 1073706356] Sending data of size 125
>>> homekit_server_on_get_characteristics: [Client 1073706356] Requested characteristic info for 1.7
>>> homekit_server_on_get_characteristics: [Client 1073706356] Requested characteristic info for 1.5
>>> client_send_chunk: [Client 1073706356] client_send_chunk, size=88, offset=4
>>> client_send: [Client 1073706356] send data size=94, encrypted=true
>>> client_send_encrypted_: [Client 1073706356] Send encrypted of size 94
>>> write: [Client 1073706356] Sending data of size 112
>>> client_send_chunk: [Client 1073706356] client_send_chunk, size=0, offset=3
>>> client_send: [Client 1073706356] send data size=5, encrypted=true
>>> client_send_encrypted_: [Client 1073706356] Send encrypted of size 5
>>> write: [Client 1073706356] Sending data of size 23
>>> write: [Client 1073706356] Sending data of size 112
>>> client_send_chunk: [Client 1073706356] client_send_chunk, size=0, offset=3
>>> client_send: [Client 1073706356] send data size=5, encrypted=true
>>> client_send_encrypted_: [Client 1073706356] Send encrypted of size 5
>>> write: [Client 1073706356] Sending data of size 23
>>> homekit_client_process: [Client 1073706356] Finished processing
>>> homekit_client_process: [Client 1073706356] Got 187 incoming data, encrypted is true
>>> homekit_client_process: [Client 1073706356] Decrypting data
>>> homekit_client_process: [Client 1073706356] Decrypted 169 bytes, available 0
>>> homekit_server_on_body: http_parser length=50
>>> homekit_server_on_message_complete: http_parser message_complete
Info	2024-10-04 06:06:59	Update Characteristics
>>> homekit_server_on_update_characteristics: Free heap: 21912
>>> homekit_server_on_update_characteristics: [Client 1073706356] Processing element {
  "aid":	1,
  "iid":	10,
  "ev":	true
}
>>> homekit_server_on_update_characteristics: [Client 1073706356] There were no processing errors, sending No Content response
>>> client_send: [Client 1073706356] send data size=27, encrypted=true
>>> client_send_encrypted_: [Client 1073706356] Send encrypted of size 27
>>> write: [Client 1073706356] Sending data of size 45
### [ 231075] update_characteristics took     56ms
>>> homekit_client_process: [Client 1073706356] Finished processing
>>> homekit_client_process: [Client 1073706356] Got 88 incoming data, encrypted is true
>>> homekit_client_process: [Client 1073706356] Decrypting data
>>> homekit_client_process: [Client 1073706356] Decrypted 70 bytes, available 0
>>> homekit_server_on_message_complete: http_parser message_complete
Info	2024-10-04 06:06:59	Get Characteristics
>>> homekit_server_on_get_characteristics: Free heap: 22232
>>> homekit_server_on_get_characteristics: [Client 1073706356] Query parameter id = 1.9
>>> homekit_server_on_get_characteristics: [Client 1073706356] Requested characteristic info for 1.9
>>> client_send: [Client 1073706356] send data size=107, encrypted=true
>>> client_send_encrypted_: [Client 1073706356] Send encrypted of size 107
>>> write: [Client 1073706356] Sending data of size 125
>>> homekit_server_on_get_characteristics: [Client 1073706356] Requested characteristic info for 1.9
>>> client_send_chunk: [Client 1073706356] client_send_chunk, size=53, offset=4
>>> client_send: [Client 1073706356] send data size=59, encrypted=true
>>> client_send_encrypted_: [Client 1073706356] Send encrypted of size 59
>>> write: [Client 1073706356] Sending data of size 77
>>> client_send_chunk: [Client 1073706356] client_send_chunk, size=0, offset=3
>>> client_send: [Client 1073706356] send data size=5, encrypted=true
>>> client_send_encrypted_: [Client 1073706356] Send encrypted of size 5
>>> write: [Client 1073706356] Sending data of size 23
>>> homekit_client_process: [Client 1073706356] Finished processing
>>> homekit_client_process: [Client 1073706356] Got 92 incoming data, encrypted is true
>>> homekit_client_process: [Client 1073706356] Decrypting data
>>> homekit_client_process: [Client 1073706356] Decrypted 74 bytes, available 0
>>> homekit_server_on_message_complete: http_parser message_complete
Info	2024-10-04 06:06:59	Get Characteristics
>>> homekit_server_on_get_characteristics: Free heap: 22112
>>> homekit_server_on_get_characteristics: [Client 1073706356] Query parameter id = 1.9,1.5
>>> homekit_server_on_get_characteristics: [Client 1073706356] Requested characteristic info for 1.9
>>> homekit_server_on_get_characteristics: [Client 1073706356] Requested characteristic info for 1.5
>>> client_send: [Client 1073706356] send data size=107, encrypted=true
>>> client_send_encrypted_: [Client 1073706356] Send encrypted of size 107
>>> write: [Client 1073706356] Sending data of size 125
>>> homekit_server_on_get_characteristics: [Client 1073706356] Requested characteristic info for 1.9
>>> homekit_server_on_get_characteristics: [Client 1073706356] Requested characteristic info for 1.5
>>> client_send_chunk: [Client 1073706356] client_send_chunk, size=88, offset=4
>>> client_send: [Client 1073706356] send data size=94, encrypted=true
>>> client_send_encrypted_: [Client 1073706356] Send encrypted of size 94
>>> write: [Client 1073706356] Sending data of size 112
>>> client_send_chunk: [Client 1073706356] client_send_chunk, size=0, offset=3
>>> client_send: [Client 1073706356] send data size=5, encrypted=true
>>> client_send_encrypted_: [Client 1073706356] Send encrypted of size 5
>>> write: [Client 1073706356] Sending data of size 23
>>> homekit_client_process: [Client 1073706356] Finished processing
Error	2024-10-04 06:07:00	HTTP_GET /var: Not found: "OBSTRUCTION_DETECTED"  From: 192.168.3.1
Info	2024-10-04 06:07:04	Disconnected!
Info	2024-10-04 06:07:04	Closing client connection
>>> homekit_server_close_client: [Client 1073706356] The socket is stopped

Info	2024-10-04 06:07:20	Got new client: local 192.168.3.76:5556, remote 192.168.3.28:63801
>>> homekit_client_process: [Client 1073705964] Got 157 incoming data, encrypted is false
>>> homekit_server_on_body: http_parser length=37
>>> homekit_server_on_message_complete: http_parser message_complete
>>> homekit_server_on_pair_verify: HomeKit Pair Verify
>>> homekit_server_on_pair_verify: Free heap: 23296
Info	2024-10-04 06:07:20	Pair Verify Step 1/2
>>> homekit_server_on_pair_verify: [Client 1073705964] Importing device Curve25519 public key
>>> homekit_server_on_pair_verify: [Client 1073705964] Generating accessory Curve25519 key
>>> homekit_server_on_pair_verify: [Client 1073705964] Exporting accessory Curve25519 public key
>>> homekit_server_on_pair_verify: [Client 1073705964] Generating Curve25519 shared secret
>>> homekit_server_on_pair_verify: [Client 1073705964] Generating signature
>>> homekit_server_on_pair_verify: [Client 1073705964] Generating proof
>>> homekit_server_on_pair_verify: [Client 1073705964] Encrypting response
>>> send_tlv_response: [Client 1073705964] Sending TLV response
>>> client_send: [Client 1073705964] send data size=244, encrypted=false
>>> write: [Client 1073705964] Sending data of size 244
### [ 252829] pair_verify took    562ms
    Free heap: 22424
>>> homekit_client_process: [Client 1073705964] Finished processing
>>> homekit_client_process: [Client 1073705964] Got 246 incoming data, encrypted is false
>>> homekit_server_on_body: http_parser length=125
>>> homekit_server_on_message_complete: http_parser message_complete
>>> homekit_server_on_pair_verify: HomeKit Pair Verify
>>> homekit_server_on_pair_verify: Free heap: 23008
Info	2024-10-04 06:07:21	Pair Verify Step 2/2
>>> homekit_server_on_pair_verify: [Client 1073705964] Decrypting payload
>>> homekit_server_on_pair_verify: [Client 1073705964] Searching pairing with 5E409937-DEAA-4A6C-B1B2-F2B85E602F50
Info	2024-10-04 06:07:21	Found pairing with 5E409937-DEAA-4A6C-B1B2-F2B85E602F50
>>> homekit_server_on_pair_verify: [Client 1073705964] Verifying device signature
Info	2024-10-04 06:07:21	Call ge_double_scalarmult_vartime_lowmem in ge_low_mem.c
>>> send_tlv_response: [Client 1073705964] Sending TLV response
>>> client_send: [Client 1073705964] send data size=105, encrypted=false
>>> write: [Client 1073705964] Sending data of size 105
Info	2024-10-04 06:07:22	Verification successful, secure session established
### [ 254581] pair_verify took   1522ms
    Free heap: 22536
>>> homekit_client_process: [Client 1073705964] Finished processing
>>> homekit_client_process: [Client 1073705964] Got 77 incoming data, encrypted is true
>>> homekit_client_process: [Client 1073705964] Decrypting data
>>> homekit_client_process: [Client 1073705964] Decrypted 59 bytes, available 0
>>> homekit_server_on_message_complete: http_parser message_complete
Info	2024-10-04 06:07:22	Get Accessories
>>> homekit_server_on_get_accessories: Free heap: 23280
>>> client_send: [Client 1073705964] send data size=107, encrypted=true
>>> client_send_encrypted_: [Client 1073705964] Send encrypted of size 107
>>> write: [Client 1073705964] Sending data of size 125
>>> homekit_server_on_get_accessories: [Client 1073705964] Get Accessories, start send json body
>>> client_send_chunk: [Client 1073705964] client_send_chunk, size=508, offset=5
>>> client_send: [Client 1073705964] send data size=515, encrypted=true
>>> client_send_encrypted_: [Client 1073705964] Send encrypted of size 515
>>> write: [Client 1073705964] Sending data of size 533
>>> client_send_chunk: [Client 1073705964] client_send_chunk, size=508, offset=5
>>> client_send: [Client 1073705964] send data size=515, encrypted=true
>>> client_send_encrypted_: [Client 1073705964] Send encrypted of size 515
>>> write: [Client 1073705964] Sending data of size 533
>>> client_send_chunk: [Client 1073705964] client_send_chunk, size=107, offset=4
>>> client_send: [Client 1073705964] send data size=113, encrypted=true
>>> client_send_encrypted_: [Client 1073705964] Send encrypted of size 113
>>> write: [Client 1073705964] Sending data of size 131
>>> client_send_chunk: [Client 1073705964] client_send_chunk, size=0, offset=3
>>> client_send: [Client 1073705964] send data size=5, encrypted=true
>>> client_send_encrypted_: [Client 1073705964] Send encrypted of size 5
>>> write: [Client 1073705964] Sending data of size 23
### [ 254796] get_accessories took    159ms
>>> homekit_client_process: [Client 1073705964] Finished processing
>>> homekit_client_process: [Client 1073705964] Got 88 incoming data, encrypted is true
>>> homekit_client_process: [Client 1073705964] Decrypting data
>>> homekit_client_process: [Client 1073705964] Decrypted 70 bytes, available 0
>>> homekit_server_on_message_complete: http_parser message_complete
Info	2024-10-04 06:07:22	Get Characteristics
>>> homekit_server_on_get_characteristics: Free heap: 23424
>>> homekit_server_on_get_characteristics: [Client 1073705964] Query parameter id = 1.9
>>> homekit_server_on_get_characteristics: [Client 1073705964] Requested characteristic info for 1.9
>>> client_send: [Client 1073705964] send data size=107, encrypted=true
>>> client_send_encrypted_: [Client 1073705964] Send encrypted of size 107
>>> write: [Client 1073705964] Sending data of size 125
>>> homekit_server_on_get_characteristics: [Client 1073705964] Requested characteristic info for 1.9
>>> client_send_chunk: [Client 1073705964] client_send_chunk, size=53, offset=4
>>> client_send: [Client 1073705964] send data size=59, encrypted=true
>>> client_send_encrypted_: [Client 1073705964] Send encrypted of size 59
>>> write: [Client 1073705964] Sending data of size 77
>>> client_send_chunk: [Client 1073705964] client_send_chunk, size=0, offset=3
>>> client_send: [Client 1073705964] send data size=5, encrypted=true
>>> client_send_encrypted_: [Client 1073705964] Send encrypted of size 5
>>> write: [Client 1073705964] Sending data of size 23
>>> homekit_client_process: [Client 1073705964] Finished processing
>>> homekit_client_process: [Client 1073705964] Got 88 incoming data, encrypted is true
>>> homekit_client_process: [Client 1073705964] Decrypting data
>>> homekit_client_process: [Client 1073705964] Decrypted 70 bytes, available 0
>>> homekit_server_on_message_complete: http_parser message_complete
Info	2024-10-04 06:07:23	Get Characteristics
>>> homekit_server_on_get_characteristics: Free heap: 23424
>>> homekit_server_on_get_characteristics: [Client 1073705964] Query parameter id = 1.5
>>> homekit_server_on_get_characteristics: [Client 1073705964] Requested characteristic info for 1.5
>>> client_send: [Client 1073705964] send data size=107, encrypted=true
>>> client_send_encrypted_: [Client 1073705964] Send encrypted of size 107
>>> write: [Client 1073705964] Sending data of size 125
>>> homekit_server_on_get_characteristics: [Client 1073705964] Requested characteristic info for 1.5
>>> client_send_chunk: [Client 1073705964] client_send_chunk, size=56, offset=4
>>> client_send: [Client 1073705964] send data size=62, encrypted=true
>>> client_send_encrypted_: [Client 1073705964] Send encrypted of size 62
>>> write: [Client 1073705964] Sending data of size 80
>>> client_send_chunk: [Client 1073705964] client_send_chunk, size=0, offset=3
>>> client_send: [Client 1073705964] send data size=5, encrypted=true
>>> client_send_encrypted_: [Client 1073705964] Send encrypted of size 5
>>> write: [Client 1073705964] Sending data of size 23
>>> homekit_client_process: [Client 1073705964] Finished processing
>>> homekit_client_process: [Client 1073705964] Got 88 incoming data, encrypted is true
>>> homekit_client_process: [Client 1073705964] Decrypting data
>>> homekit_client_process: [Client 1073705964] Decrypted 70 bytes, available 0
>>> homekit_server_on_message_complete: http_parser message_complete
Info	2024-10-04 06:07:23	Get Characteristics
>>> homekit_server_on_get_characteristics: Free heap: 23424
>>> homekit_server_on_get_characteristics: [Client 1073705964] Query parameter id = 1.5
>>> homekit_server_on_get_characteristics: [Client 1073705964] Requested characteristic info for 1.5
>>> client_send: [Client 1073705964] send data size=107, encrypted=true
>>> client_send_encrypted_: [Client 1073705964] Send encrypted of size 107
>>> write: [Client 1073705964] Sending data of size 125
>>> homekit_server_on_get_characteristics: [Client 1073705964] Requested characteristic info for 1.5
>>> client_send_chunk: [Client 1073705964] client_send_chunk, size=56, offset=4
>>> client_send: [Client 1073705964] send data size=62, encrypted=true
>>> client_send_encrypted_: [Client 1073705964] Send encrypted of size 62
>>> write: [Client 1073705964] Sending data of size 80
>>> client_send_chunk: [Client 1073705964] client_send_chunk, size=0, offset=3
>>> client_send: [Client 1073705964] send data size=5, encrypted=true
>>> client_send_encrypted_: [Client 1073705964] Send encrypted of size 5
>>> homekit_client_process: [Client 1073705964] Finished processing
>>> homekit_client_process: [Client 1073705964] Got 187 incoming data, encrypted is true
>>> homekit_client_process: [Client 1073705964] Decrypting data
>>> homekit_client_process: [Client 1073705964] Decrypted 169 bytes, available 0
>>> homekit_server_on_body: http_parser length=50
>>> homekit_server_on_message_complete: http_parser message_complete
Info	2024-10-04 06:07:23	Update Characteristics
>>> homekit_server_on_update_characteristics: Free heap: 23304
>>> homekit_server_on_update_characteristics: [Client 1073705964] Processing element {
  "aid":	1,
  "iid":	10,
  "ev":	true
}
>>> homekit_server_on_update_characteristics: [Client 1073705964] There were no processing errors, sending No Content response
>>> client_send: [Client 1073705964] send data size=27, encrypted=true
>>> client_send_encrypted_: [Client 1073705964] Send encrypted of size 27
>>> write: [Client 1073705964] Sending data of size 45
### [ 255351] update_characteristics took     54ms
>>> homekit_client_process: [Client 1073705964] Finished processing
>>> homekit_client_process: [Client 1073705964] Got 88 incoming data, encrypted is true
>>> homekit_client_process: [Client 1073705964] Decrypting data
>>> homekit_client_process: [Client 1073705964] Decrypted 70 bytes, available 0
>>> homekit_server_on_message_complete: http_parser message_complete
Info	2024-10-04 06:07:23	Get Characteristics
>>> homekit_server_on_get_characteristics: Free heap: 23408
>>> homekit_server_on_get_characteristics: [Client 1073705964] Query parameter id = 1.9
>>> homekit_server_on_get_characteristics: [Client 1073705964] Requested characteristic info for 1.9
>>> client_send: [Client 1073705964] send data size=107, encrypted=true
>>> client_send_encrypted_: [Client 1073705964] Send encrypted of size 107
>>> write: [Client 1073705964] Sending data of size 125
>>> homekit_server_on_get_characteristics: [Client 1073705964] Requested characteristic info for 1.9
>>> client_send_chunk: [Client 1073705964] client_send_chunk, size=53, offset=4
>>> client_send: [Client 1073705964] send data size=59, encrypted=true
>>> client_send_encrypted_: [Client 1073705964] Send encrypted of size 59
>>> write: [Client 1073705964] Sending data of size 77
>>> client_send_chunk: [Client 1073705964] client_send_chunk, size=0, offset=3
>>> client_send: [Client 1073705964] send data size=5, encrypted=true
>>> client_send_encrypted_: [Client 1073705964] Send encrypted of size 5
>>> write: [Client 1073705964] Sending data of size 23
>>> homekit_client_process: [Client 1073705964] Finished processing
Info	2024-10-04 06:07:29	Disconnected!
Info	2024-10-04 06:07:29	Closing client connection
>>> homekit_server_close_client: [Client 1073705964] The socket is stopped

*/

#pragma endregion


