HolgerBurkarth/HomeKit-ESP8266/src/arduino_homekit_server.cpp
//END Protocols
#pragma endregion

#pragma region LockWebServer
static uint32_t gbHttpReqCount{};
static uint32_t gbHttpReqCountIdle{};

void homekit_touch_http_request()
{
  if(gbHttpReqCountIdle == gbHttpReqCount)
  {
    system_update_cpu_freq(SYS_CPU_160MHZ);
    VERBOSE("Set 160MHz (leave HTTP idle)");
  }
  
  ++gbHttpReqCount;
}

uint32_t homekit_http_request_count()
{
  return gbHttpReqCount;
}

void homekit_enter_http_idle()
{
  if(gbHttpReqCountIdle != gbHttpReqCount)
  {
    gbHttpReqCountIdle = gbHttpReqCount;

    system_update_cpu_freq(SYS_CPU_80MHZ);
    VERBOSE("Set 80MHz (enter HTTP idle)");
  }
}

static void LockWebServer(bool enterLock)
{
  homekit_touch_http_request();

  if(enterLock)
  {
    VERBOSE("Enter LockWebServer\n");
  }
  else
  {
    VERBOSE("Leave LockWebServer\n");
  }
}

#pragma endregion

#pragma region Globals

static client_context_t* current_client_context = NULL;
static homekit_server_t* running_server = nullptr;
static WiFiEventHandler arduino_homekit_gotiphandler;

// Arduino ESP8266 MDNS: call this function only once when WiFi STA is connected!
static bool homekit_mdns_started = false;

static const char PROGMEM json_200_response_headers_progmem[] = "HTTP/1.1 200 OK\r\n"
"Content-Type: application/hap+json\r\n"
"Transfer-Encoding: chunked\r\n"
"Connection: keep-alive\r\n\r\n";

static const char PROGMEM json_207_response_headers_progmem[] = "HTTP/1.1 207 Multi-Status\r\n"
"Content-Type: application/hap+json\r\n"
"Transfer-Encoding: chunked\r\n"
"Connection: keep-alive\r\n\r\n";

pairing_context_t* saved_preinit_pairing_context = nullptr;

#pragma endregion

#pragma region Protos
void client_context_free(client_context_t* c);
void pairing_context_free(pairing_context_t* context);
void homekit_server_close_client(homekit_server_t* server, client_context_t* context);
bool arduino_homekit_preinit(homekit_server_t* server);
void homekit_client_process(client_context_t* context);
void send_tlv_response(client_context_t* context, tlv_values_t* values);

//pairing context
void client_notify_characteristic(homekit_characteristic_t* ch, homekit_value_t value, void* client);


#pragma endregion

#pragma region server_new
homekit_server_t* server_new()
{
  homekit_server_t* server = (homekit_server_t*)malloc(sizeof(homekit_server_t));
  server->wifi_server = new WiFiServer(HOMEKIT_SERVER_PORT);
  server->wifi_server->begin();
  server->wifi_server->setNoDelay(true);
  DEBUG("WiFiServer begin at port: %d", HOMEKIT_SERVER_PORT);
  //FD_ZERO(&server->fds);
  //server->max_fd = 0;
  server->nfds = 0;
  server->config = NULL;
  server->paired = false;
  server->pairing_context = NULL;
  server->clients = NULL;
  return server;
}

#pragma endregion

#pragma region server_free
void server_free(homekit_server_t* server)
{
  if(server->pairing_context)
    pairing_context_free(server->pairing_context);

  if(server->clients)
  {
    client_context_t* client = server->clients;
    while(client)
    {
      client_context_t* next = client->next;
      client_context_free(client);
      client = next;
    }
  }
  if(server->wifi_server)
  {
    server->wifi_server->stop();
    server->wifi_server->close();
    delete server->wifi_server;
    server->wifi_server = nullptr;
  }
  DEBUG("homekit_server_t delete WiFiServer at port: %d\n", HOMEKIT_SERVER_PORT);

  if(server == running_server)
  {
    running_server = NULL;
  }
  free(server);
}

#pragma endregion

#pragma region tlv_debug
void tlv_debug(const tlv_values_t* values)
{
  DEBUG("Got following TLV values:");
  for(tlv_t* t = values->head; t; t = t->next)
  {
    char* escaped_payload = binary_to_string(t->value, t->size);
    DEBUG("Type %d value (%d bytes): %s", t->type, t->size, escaped_payload);
    free(escaped_payload);
  }
}

#pragma endregion

#pragma region pair_verify_context_new
pair_verify_context_t* pair_verify_context_new()
{
  pair_verify_context_t* context = (pair_verify_context_t*)malloc(sizeof(pair_verify_context_t));

  context->secret = NULL;
  context->secret_size = 0;

  context->session_key = NULL;
  context->session_key_size = 0;
  context->device_public_key = NULL;
  context->device_public_key_size = 0;
  context->accessory_public_key = NULL;
  context->accessory_public_key_size = 0;

  return context;
}

#pragma endregion

#pragma region pair_verify_context_free
void pair_verify_context_free(pair_verify_context_t* context)
{
  if(context->secret)
    free(context->secret);

  if(context->session_key)
    free(context->session_key);

  if(context->device_public_key)
    free(context->device_public_key);

  if(context->accessory_public_key)
    free(context->accessory_public_key);

  free(context);
}

#pragma endregion

#pragma region client_context_new
//==========================
// client_context new and free
//============================
client_context_t* client_context_new(WiFiClient* wifiClient)
{
  client_context_t* c = (client_context_t*)malloc(sizeof(client_context_t));
  c->server = NULL;
  c->endpoint_params = NULL;

  c->data_size = sizeof(c->data);
  c->data_available = 0;

  c->body = NULL;
  c->body_length = 0;
  http_parser_init(&c->parser, HTTP_REQUEST);
  c->parser.data = c;

  c->pairing_id = -1;
  c->encrypted = false;
  c->count_reads = 0;
  c->count_writes = 0;
  c->disconnect = false;

  //c->event_queue = xQueueCreate(20, sizeof(characteristic_event_t*));
  c->event_queue = (Queue_t*)malloc(sizeof(Queue_t));
  q_init(c->event_queue, sizeof(characteristic_event_t*),
    HOMEKIT_EVENT_QUEUE_SIZE, LIFO, true);

  c->verify_context = NULL;

  c->next = NULL;

  c->socket = wifiClient;

  c->step = HOMEKIT_CLIENT_STEP_NONE;
  c->error_write = false;

  return c;
}

#pragma endregion

#pragma region client_context_free
void client_context_free(client_context_t* c)
{
  if(c->verify_context)
    pair_verify_context_free(c->verify_context);

  if(c->event_queue)
  {
    //c->event_queue->clear();
    q_clean(c->event_queue);
    q_kill(c->event_queue);
    free(c->event_queue);
  }

  if(c->endpoint_params)
    query_params_free(c->endpoint_params);

  if(c->body)
    free(c->body);

  if(c->socket)
  {
    c->socket->stop();
    delete c->socket;
    c->socket = nullptr;
  }

