HolgerBurkarth/HomeKit-ESP8266/src/arduino_homekit_server.cpp
  free(c);
}

#pragma endregion

#pragma region pairing_context_new
pairing_context_t* pairing_context_new()
{
  pairing_context_t* context = (pairing_context_t*)malloc(sizeof(pairing_context_t));
  context->srp = crypto_srp_new();
  context->client = NULL;
  context->public_key = NULL;
  context->public_key_size = 0;
  return context;
}

#pragma endregion

#pragma region pairing_context_free
void pairing_context_free(pairing_context_t* context)
{
  if(context == saved_preinit_pairing_context)
  {
    VERBOSE("Free saved_preinit_pairing_context");
    if(saved_preinit_pairing_context)
    {
      saved_preinit_pairing_context = nullptr;
    }
  }
  if(context->srp)
  {
    crypto_srp_free(context->srp);
  }
  if(context->public_key)
  {
    free(context->public_key);
  }
  free(context);
}

#pragma endregion

#pragma region write_characteristic_json
void write_characteristic_json(json_stream* json, client_context_t* client,
  const homekit_characteristic_t* ch, characteristic_format_t format,
  const homekit_value_t* value)
{
  json_string(json, "aid");
  json_uint32(json, ch->service->accessory->id);
  json_string(json, "iid");
  json_uint32(json, ch->id);

  if(format & characteristic_format_type)
  {
    json_string(json, "type");
    json_string(json, ch->type);
  }

  if(format & characteristic_format_perms)
  {
    json_string(json, "perms");
    json_array_start(json);
    if(ch->permissions & homekit_permissions_paired_read)
      json_string(json, "pr");
    if(ch->permissions & homekit_permissions_paired_write)
      json_string(json, "pw");
    if(ch->permissions & homekit_permissions_notify)
      json_string(json, "ev");
    if(ch->permissions & homekit_permissions_additional_authorization)
      json_string(json, "aa");
    if(ch->permissions & homekit_permissions_timed_write)
      json_string(json, "tw");
    if(ch->permissions & homekit_permissions_hidden)
      json_string(json, "hd");
    json_array_end(json);
  }

  if((format & characteristic_format_events) && (ch->permissions & homekit_permissions_notify))
  {
    bool events = homekit_characteristic_has_notify_callback(ch, client_notify_characteristic,
      client);
    json_string(json, "ev");
    json_boolean(json, events);
  }

  if(format & characteristic_format_meta)
  {
    if(ch->description)
    {
      json_string(json, "description");
      json_string(json, ch->description);
    }

    const char* format_str = NULL;
    switch(ch->format)
    {
      case homekit_format_bool:
        format_str = "bool";
        break;
      case homekit_format_uint8:
        format_str = "uint8";
        break;
      case homekit_format_uint16:
        format_str = "uint16";
        break;
      case homekit_format_uint32:
        format_str = "uint32";
        break;
      case homekit_format_uint64:
        format_str = "uint64";
        break;
      case homekit_format_int:
        format_str = "int";
        break;
      case homekit_format_float:
        format_str = "float";
        break;
      case homekit_format_string:
        format_str = "string";
        break;
      case homekit_format_tlv:
        format_str = "tlv8";
        break;
      case homekit_format_data:
        format_str = "data";
        break;
    }
    if(format_str)
    {
      json_string(json, "format");
      json_string(json, format_str);
    }

    const char* unit_str = NULL;
    switch(ch->unit)
    {
      case homekit_unit_none:
        break;
      case homekit_unit_celsius:
        unit_str = "Celsius";
        break;
      case homekit_unit_percentage:
        unit_str = "percentage";
        break;
      case homekit_unit_arcdegrees:
        unit_str = "arcdegrees";
        break;
      case homekit_unit_lux:
        unit_str = "Lux";
        break;
      case homekit_unit_seconds:
        unit_str = "seconds";
        break;
    }
    if(unit_str)
    {
      json_string(json, "unit");
      json_string(json, unit_str);
    }

    if(ch->min_value)
    {
      json_string(json, "minValue");
      json_float(json, *ch->min_value);
    }

    if(ch->max_value)
    {
      json_string(json, "maxValue");
      json_float(json, *ch->max_value);
    }

    if(ch->min_step)
    {
      json_string(json, "minStep");
      json_float(json, *ch->min_step);
    }

    if(ch->max_len)
    {
      json_string(json, "maxLen");
      json_uint32(json, *ch->max_len);
    }

    if(ch->max_data_len)
    {
      json_string(json, "maxDataLen");
      json_uint32(json, *ch->max_data_len);
    }

    if(ch->valid_values.count)
    {
      json_string(json, "valid-values");
      json_array_start(json);

      for(int i = 0; i < ch->valid_values.count; i++)
      {
        json_uint16(json, ch->valid_values.values[i]);
      }

      json_array_end(json);
    }

    if(ch->valid_values_ranges.count)
    {
      json_string(json, "valid-values-range");
      json_array_start(json);

      for(int i = 0; i < ch->valid_values_ranges.count; i++)
      {
        json_array_start(json);

        json_integer(json, ch->valid_values_ranges.ranges[i].start);
        json_integer(json, ch->valid_values_ranges.ranges[i].end);

        json_array_end(json);
      }

      json_array_end(json);
    }
  }

  if(ch->permissions & homekit_permissions_paired_read)
  {
    homekit_value_t v = value ? *value : ch->getter_ex ? ch->getter_ex(ch) : ch->value;

    if(v.is_null)
    {
      json_string(json, "value"); json_null(json);
    }
    else if(v.format != ch->format)
    {
      ERROR("Characteristic value format is different from characteristic format");
    }
    else
    {
      #if 0
      if(ch->getter_ex)
      {
        using namespace HBHomeKit;
        char valbuf[64]{};
        homekit_characteristic_t* Ch = const_cast<homekit_characteristic_t*>(ch);

        homekit_value_destruct(&Ch->value);
        homekit_value_copy(&Ch->value, &v);

        to_string(ch->value, valbuf, sizeof(valbuf));
        valbuf[sizeof(valbuf) - 1] = 0;
        INFO("Assigned: \"%s\" = %s", ch->description, valbuf);
      }
      #endif // 0


      switch(v.format)
      {
        case homekit_format_bool:
          {
            json_string(json, "value");
            json_boolean(json, v.bool_value);
            break;
          }
        case homekit_format_uint8:
          {
            json_string(json, "value");
            json_uint8(json, v.uint8_value);
            break;
          }
        case homekit_format_uint16:
          {
            json_string(json, "value");
            json_uint16(json, v.uint16_value);
            break;
          }
        case homekit_format_uint32:
          {
            json_string(json, "value");
            json_uint32(json, v.uint32_value);
            break;
          }
        case homekit_format_uint64:
          {
            json_string(json, "value");
            json_uint64(json, v.uint64_value);
            break;
          }
        case homekit_format_int:
          {
            json_string(json, "value");
            json_integer(json, v.int_value);
            break;
          }
        case homekit_format_float:
          {
            json_string(json, "value");
            json_float(json, v.float_value);
            break;
          }
        case homekit_format_string:
          {
            json_string(json, "value");
            json_string(json, v.string_value);
            break;
          }
        case homekit_format_tlv:
          {
            json_string(json, "value");
            if(!v.tlv_values)
            {
              json_string(json, "");
            }
            else
            {
              size_t tlv_size = 0;
              tlv_format(v.tlv_values, NULL, &tlv_size);
              if(tlv_size == 0)
              {
                json_string(json, "");
              }
              else
              {
                byte* tlv_data = (byte*)malloc(tlv_size);
                tlv_format(v.tlv_values, tlv_data, &tlv_size);

                size_t encoded_tlv_size = base64_encoded_size(tlv_data, tlv_size);
                byte* encoded_tlv_data = (byte*)malloc(encoded_tlv_size + 1);
                base64_encode_(tlv_data, tlv_size, encoded_tlv_data);
                encoded_tlv_data[encoded_tlv_size] = 0;

                json_string(json, (char*)encoded_tlv_data);

                free(encoded_tlv_data);
                free(tlv_data);
              }
            }
            break;
          }
        case homekit_format_data:
          {
            json_string(json, "value");
            if(!v.data_value || v.data_size == 0)
            {
              json_string(json, "");
            }
            else
            {
              size_t encoded_data_size = base64_encoded_size(v.data_value, v.data_size);
              byte* encoded_data = (byte*)malloc(encoded_data_size + 1);
              base64_encode_(v.data_value, v.data_size, encoded_data);
              encoded_data[encoded_data_size] = 0;

              json_string(json, (char*)encoded_data);

              free(encoded_data);
            }

            break;
          }
      }
    }

    if(!value && ch->getter_ex)
    {
      // called getter to get value, need to free it
      homekit_value_destruct(&v);
    }
  }
}

#pragma endregion

#pragma region write
void write(client_context_t* context, byte* data, int data_size)
{
  if((!context) || (!context->socket) || (!context->socket->connected()))
  {
    CLIENT_ERROR(context, "The socket is null! (or is closed)");
    return;
  }
  if(context->error_write)
  {
    CLIENT_ERROR(context, "Abort write data since error_write.");
    return;
  }
  int write_size = context->socket->write(data, data_size);
  CLIENT_DEBUG(context, "Sending data of size %d", data_size);
  if(write_size != data_size)
  {
    CLIENT_ERROR(context, "socket.write, data_size=%d, write_size=%d", data_size, write_size);
    context->error_write = true;
    // Error write when :
    // 1. remote client is disconnected
    // 2. data_size is larger than the tcp internal send buffer
    // But We has limited the data_size to 538, and TCP_SND_BUF = 1072. (See the comments on HOMEKIT_JSONBUFFER_SIZE)
    // So we believe here is disconnected.
    context->disconnect = true;
    homekit_server_close_client(context->server, context);
    // We consider the socket is 'closed' when error in writing (e.g. the remote client is disconnected, NO tcp ack receive).
    // Closing the socket causes memory-leak if some data has not been sent (the write_buffer did not free)
    // To fix this memory-leak, add tcp_abandon(_pcb, 0); in ClientContext.h of ESP8266WiFi-library.
  }

