HolgerBurkarth/HomeKit-ESP8266/src/arduino_homekit_server.cpp
}

#pragma endregion

#pragma region client_send_encrypted_
int client_send_encrypted_(client_context_t* context, byte* payload, size_t size)
{
  CLIENT_DEBUG(context, "Send encrypted of size %d", size);
  // max(size) = HOMEKIT_JSONBUFFER_SIZE + chunk_info(8) = 512 + 8 = 520
  if(!context || !context->encrypted)
    return -1;

  /*
   HAP doc:
   Each HTTP message is split into frames no larger than 1024 bytes.
   Each frame has the following format:
   <2:AAD for little endian length of encrypted data (n) in bytes>
   <n:encrypted data according to AEAD algorithm, up to 1024 bytes>
   <16:authTag according to AEAD algorithm>
   Note by Wang Bin. 2020-03-07
   */

  byte nonce[12];
  memset(nonce, 0, sizeof(nonce));

  byte encrypted[1024 + 18];
  int payload_offset = 0;

  while(payload_offset < size)
  {
    size_t chunk_size = size - payload_offset;
    if(chunk_size > 1024)
      chunk_size = 1024;

    byte aead[2] = { chunk_size % 256, chunk_size / 256 };

    memcpy(encrypted, aead, 2);

    byte i = 4;
    int x = context->count_reads++;
    while(x)
    {
      nonce[i++] = x % 256;
      x /= 256;
    }

    size_t available = sizeof(encrypted) - 2;
    int r = crypto_chacha20poly1305_encrypt(context->read_key, nonce, aead, 2,
      payload + payload_offset, chunk_size, encrypted + 2, &available);
    if(r)
    {
      ERROR("Failed to chacha encrypt payload (code %d)", r);
      return -1;
    }

    payload_offset += chunk_size;

    write(context, encrypted, available + 2);
  }

  return 0;
}

#pragma endregion

#pragma region client_decrypt_
int client_decrypt_(client_context_t* context, byte* payload, size_t payload_size, byte* decrypted, size_t* decrypted_size)
{
  if(!context || !context->encrypted)
    return -1;

  const size_t block_size = 1024 + 16 + 2;
  size_t required_decrypted_size = payload_size / block_size * 1024;
  if(payload_size % block_size > 0)
    required_decrypted_size += payload_size % block_size - 16 - 2;

  if(*decrypted_size < required_decrypted_size)
  {
    *decrypted_size = required_decrypted_size;
    return -2;
  }

  *decrypted_size = required_decrypted_size;

  byte nonce[12];
  memset(nonce, 0, sizeof(nonce));

  int payload_offset = 0;
  int decrypted_offset = 0;

  while(payload_offset < payload_size)
  {
    size_t chunk_size = payload[payload_offset] + payload[payload_offset + 1] * 256;
    if(chunk_size + 18 > payload_size - payload_offset)
    {
      // Unfinished chunk
      break;
    }

    byte i = 4;
    int x = context->count_writes++;
    while(x)
    {
      nonce[i++] = x % 256;
      x /= 256;
    }

    size_t decrypted_len = *decrypted_size - decrypted_offset;
    int r = crypto_chacha20poly1305_decrypt(context->write_key, nonce, payload + payload_offset,
      2, payload + payload_offset + 2, chunk_size + 16, decrypted, &decrypted_len);
    if(r)
    {
      ERROR("Failed to chacha decrypt payload (code %d)", r);
      return -1;
    }

    decrypted_offset += decrypted_len;
    payload_offset += chunk_size + 18;
  }

  return payload_offset;
}

#pragma endregion

#pragma region client_notify_characteristic
void client_notify_characteristic(homekit_characteristic_t* ch, homekit_value_t value, void* context)
{
  client_context_t* client = (client_context_t*)context;

  if(client->current_characteristic == ch
    && client->current_value
    && homekit_value_equal(client->current_value, &value))
  {
    // This value is set by this client, no need to send notification
    CLIENT_VERBOSE(client, "This value is set by this client, no need to send notification");
    return;
  }
  //CLIENT_INFO(client, "Got characteristic %d.%d change event", ch->service->accessory->id, ch->id);
  DEBUG("Got characteristic %d.%d change event", ch->service->accessory->id, ch->id);

  if(!client->event_queue)
  {
    ERROR("Client has no event queue. Skipping notification");
    return;
  }

  characteristic_event_t* event = (characteristic_event_t*)malloc(
    sizeof(characteristic_event_t));
  event->characteristic = ch;
  homekit_value_copy(&event->value, &value);

  DEBUG("Sending event to client %d", client->socket);
  CLIENT_INFO(client, "Sending event %s", ch->description);

  //xQueueSendToBack(client->event_queue, &event, 10);*/
  q_push(client->event_queue, &event);
}

#pragma endregion

#pragma region client_send
void client_send(client_context_t* context, byte* data, size_t data_size)
{

  CLIENT_DEBUG(context, "send data size=%d, encrypted=%s",
    data_size, context->encrypted ? "true" : "false");

  if(context->encrypted)
  {
    int r = client_send_encrypted_(context, data, data_size);
    if(r)
    {
      CLIENT_ERROR(context, "Failed to encrypt response (code %d)", r);
      return;
    }
  }
  else
  {
    write(context, data, data_size);
  }
}

#pragma endregion

#pragma region client_send_P
void client_send_P(client_context_t* context, PGM_P pgm)
{
  XPGM_BUFFCPY_STRING(char, buff, pgm);
  client_send(context, (byte*)buff, sizeof(buff) - 1);
}

#pragma endregion

#pragma region client_send_chunk
void client_send_chunk(byte* data, size_t size, void* arg)
{
  client_context_t* context = (client_context_t*)arg;

  size_t payload_size = size + 8;
  byte* payload = (byte*)malloc(payload_size);
  if(!payload)
  {
    ERROR("Error malloc payload!! payload_size->%d", payload_size);
    return;
  }

  int offset = snprintf((char*)payload, payload_size, "%x\r\n", size);
  memcpy(payload + offset, data, size);
  payload[offset + size] = '\r';
  payload[offset + size + 1] = '\n';
  CLIENT_DEBUG(context, "client_send_chunk, size=%d, offset=%d", size, offset);
  client_send(context, payload, offset + size + 2);
  free(payload);
}

#pragma endregion

#pragma region send_204_response
void send_204_response(client_context_t* context)
{
  static const char PROGMEM response[] = "HTTP/1.1 204 No Content\r\n\r\n";
  client_send_P(context, response);
}

#pragma endregion

#pragma region send_404_response
void send_404_response(client_context_t* context)
{
  static const char PROGMEM response[] = "HTTP/1.1 404 Not Found\r\n\r\n";
  client_send_P(context, response);
}

#pragma endregion

#pragma region send_client_events
void send_client_events(client_context_t* context, client_event_t* events)
{
  CLIENT_DEBUG(context, "Sending EVENT"); DEBUG_HEAP();

