HolgerBurkarth/HomeKit-ESP8266/src/arduino_homekit_server.cpp
  static const char PROGMEM http_headers[] = "EVENT/1.0 200 OK\r\n"
    "Content-Type: application/hap+json\r\n"
    "Transfer-Encoding: chunked\r\n\r\n";
  client_send_P(context, http_headers);

  // ~35 bytes per event JSON
  // 256 should be enough for ~7 characteristic updates
  json_stream* json = json_new(HOMEKIT_JSONBUFFER_SIZE, client_send_chunk, context);
  json_object_start(json);
  json_string(json, "characteristics");
  json_array_start(json);

  client_event_t* e = events;
  while(e)
  {
    json_object_start(json);
    write_characteristic_json(json, context, e->characteristic, (characteristic_format_t)0,
      &e->value);
    json_object_end(json);

    e = e->next;
  }

  json_array_end(json);
  json_object_end(json);

  json_flush(json);
  json_free(json);

  client_send_chunk(NULL, 0, context);
}

#pragma endregion

#pragma region send_tlv_error_response
void send_tlv_error_response(client_context_t* context, int state, TLVError error)
{
  tlv_values_t* response = tlv_new();
  tlv_add_integer_value(response, TLVType_State, 1, state);
  tlv_add_integer_value(response, TLVType_Error, 1, error);

  send_tlv_response(context, response);
}

#pragma endregion

#pragma region send_tlv_response
void send_tlv_response(client_context_t* context, tlv_values_t* values)
{
  CLIENT_DEBUG(context, "Sending TLV response"); TLV_DEBUG(values);

  size_t payload_size = 0;
  tlv_format(values, NULL, &payload_size);

  byte* payload = (byte*)malloc(payload_size);
  int r = tlv_format(values, payload, &payload_size);
  if(r)
  {
    CLIENT_ERROR(context, "Failed to format TLV payload (code %d)", r);
    free(payload);
    return;
  }

  tlv_free(values);

  static const char PROGMEM http_headers_pgm[] = "HTTP/1.1 200 OK\r\n"
    "Content-Type: application/pairing+tlv8\r\n"
    "Content-Length: %d\r\n"
    "Connection: keep-alive\r\n\r\n";

  XPGM_BUFFCPY_STRING(char, http_headers, http_headers_pgm);

  int response_size = strlen(http_headers) + payload_size + 32;
  char* response = (char*)malloc(response_size);
  int response_len = snprintf(response, response_size, http_headers, payload_size);

  if(response_size - response_len < payload_size + 1)
  {
    CLIENT_ERROR(context, "Incorrect response buffer size %d: headers took %d, payload size %d",
      response_size, response_len, payload_size);
    free(response);
    free(payload);
    return;
  }
  memcpy(response + response_len, payload, payload_size);
  response_len += payload_size;

  free(payload);

  client_send(context, (byte*)response, response_len);

  free(response);
}

#pragma endregion

#pragma region send_json_response
void send_json_response(client_context_t* context, int status_code, byte* payload, size_t payload_size)
{
  CLIENT_DEBUG(context, "Sending JSON response"); DEBUG_HEAP();

  static const char PROGMEM http_headers_pgm[] = "HTTP/1.1 %d %s\r\n"
    "Content-Type: application/hap+json\r\n"
    "Content-Length: %d\r\n"
    "Connection: keep-alive\r\n\r\n";

  XPGM_BUFFCPY_STRING(char, http_headers, http_headers_pgm);

  CLIENT_DEBUG(context, "Payload: %s", payload);

  // Using PSTR and strcpy_P. Ref: ESP.getResetReason
  //const char *status_text = "OK";
  char status_text[32];
  strcpy_P(status_text, PSTR("OK"));
  switch(status_code)
  {
    case 204:
      strcpy_P(status_text, PSTR("No Content"));
      break;
    case 207:
      strcpy_P(status_text, PSTR("Multi-Status"));
      break;
    case 400:
      strcpy_P(status_text, PSTR("Bad Request"));
      break;
    case 404:
      strcpy_P(status_text, PSTR("Not Found"));
      break;
    case 422:
      strcpy_P(status_text, PSTR("Unprocessable Entity"));
      break;
    case 500:
      strcpy_P(status_text, PSTR("Internal Server Error"));
      break;
    case 503:
      strcpy_P(status_text, PSTR("Service Unavailable"));
      break;
  }

  int response_size = strlen(http_headers) + payload_size + strlen(status_text) + 32;
  char* response = (char*)malloc(response_size);
  if(!response)
  {
    CLIENT_ERROR(context, "Failed to allocate response buffer of size %d", response_size);
    return;
  }
  int response_len = snprintf(response, response_size, http_headers, status_code, status_text,
    payload_size);

  if(response_size - response_len < payload_size + 1)
  {
    CLIENT_ERROR(context, "Incorrect response buffer size %d: headers took %d, payload size %d",
      response_size, response_len, payload_size);
    free(response);
    return;
  }
  memcpy(response + response_len, payload, payload_size);
  response_len += payload_size;
  response[response_len] = 0;  // required for debug output

  CLIENT_DEBUG(context, "Sending HTTP response: %s", response);

  client_send(context, (byte*)response, response_len);

  free(response);
}

#pragma endregion

#pragma region send_json_error_response
void send_json_error_response(client_context_t* context, int status_code, HAPStatus status)
{
  byte buffer[32];
  int size = snprintf((char*)buffer, sizeof(buffer), "{\"status\": %d}", status);

  send_json_response(context, status_code, buffer, size);
}

#pragma endregion

#pragma region homekit_get_client_id
homekit_client_id_t homekit_get_client_id()
{
  return (homekit_client_id_t)current_client_context;
}

#pragma endregion

#pragma region homekit_client_is_admin
bool homekit_client_is_admin()
{
  if(!current_client_context)
    return false;

  return current_client_context->permissions & pairing_permissions_admin;
}

#pragma endregion

#pragma region homekit_client_send
int homekit_client_send(unsigned char* data, size_t size)
{
  if(!current_client_context)
    return -1;
  client_send(current_client_context, data, size);
  return 0;
}

#pragma endregion

#pragma region homekit_server_on_identify
void homekit_server_on_identify(client_context_t* context)
{
  CLIENT_INFO(context, "On Identify"); DEBUG_HEAP();
  if(context->server->paired)
  {
    // Already paired
    send_json_error_response(context, 400, HAPStatus_InsufficientPrivileges);
    return;
  }
  send_204_response(context);
  homekit_accessory_t* accessory 
    = homekit_accessory_by_id(context->server->config->accessories, 1);
  if(!accessory)
  {
    return;
  }

  homekit_service_t* accessory_info 
    = homekit_service_by_type(accessory, HOMEKIT_SERVICE_ACCESSORY_INFORMATION);
  if(!accessory_info)
  {
    return;
  }

  homekit_characteristic_t* ch_identify = homekit_service_characteristic_by_type(accessory_info,
    HOMEKIT_CHARACTERISTIC_IDENTIFY);
  if(!ch_identify)
  {
    return;
  }
  if(ch_identify->setter_ex)
  {
    ch_identify->setter_ex(ch_identify, HOMEKIT_BOOL_CPP(true));
  }
}

#pragma endregion

#pragma region homekit_server_on_pair_setup
void homekit_server_on_pair_setup(client_context_t* context, const byte* data, size_t size)
{
  DEBUG("Pair Setup"); DEBUG_HEAP();
  DEBUG_TIME_BEGIN();

