HolgerBurkarth/HomeKit-ESP8266/src/arduino_homekit_server.cpp
  #ifdef HOMEKIT_OVERCLOCK_PAIR_SETUP
  homekit_overclock_start();
  #endif

  // First set step=NONE, if pair-setup OK then set step=1or2or3
  // (if pair-step error, the step is NONE)

  context->step = HOMEKIT_CLIENT_STEP_NONE;

  tlv_values_t* message = tlv_new();
  tlv_parse(data, size, message);
  TLV_DEBUG(message);
  switch(tlv_get_integer_value(message, TLVType_State, -1))
  {
    case 1:
      {
        CLIENT_INFO(context, "Pair Setup Step 1/3"); DEBUG_HEAP();
        if(context->server->paired)
        {
          CLIENT_INFO(context, "Refusing to pair: already paired");
          send_tlv_error_response(context, 2, TLVError_Unavailable);
          break;
        }
        if(context->server->pairing_context)
        {
          if(context->server->pairing_context->client != context)
          {
            CLIENT_INFO(context, "Refusing to pair: another pairing in progress");
            send_tlv_error_response(context, 2, TLVError_Busy);
            break;
          }
        }
        else
        {
          // arduino homekit preinit (create pairing_context)
          if(!arduino_homekit_preinit(context->server))
          {
            CLIENT_ERROR(context, "Init pairing context error");
            send_tlv_error_response(context, 2, TLVError_Unknown);
            break;
          }
          if(saved_preinit_pairing_context == nullptr)
          {
            CLIENT_ERROR(context, "The saved_preinit_pairing_context is NULL ?!");
            send_tlv_error_response(context, 2, TLVError_Unknown);
            break;
          }
          context->server->pairing_context = saved_preinit_pairing_context; ///pairing_context_new();
          context->server->pairing_context->client = context;
        }

        int r = 0;
        size_t salt_size = 0;
        crypto_srp_get_salt(context->server->pairing_context->srp, NULL, &salt_size);
        byte* salt = (byte*)malloc(salt_size);
        r = crypto_srp_get_salt(context->server->pairing_context->srp, salt, &salt_size);
        if(r)
        {
          CLIENT_ERROR(context, "Failed to get salt (code %d)", r);
          free(salt);
          pairing_context_free(context->server->pairing_context);
          context->server->pairing_context = NULL;
          send_tlv_error_response(context, 2, TLVError_Unknown);
          break;
        }
        tlv_values_t* response = tlv_new();
        tlv_add_value(response, TLVType_PublicKey, context->server->pairing_context->public_key,
          context->server->pairing_context->public_key_size);
        tlv_add_value(response, TLVType_Salt, salt, salt_size);
        tlv_add_integer_value(response, TLVType_State, 1, 2);
        free(salt);
        send_tlv_response(context, response);
        context->step = HOMEKIT_CLIENT_STEP_PAIR_SETUP_1OF3;
        break;
      }
    case 3:
      {
        CLIENT_INFO(context, "Pair Setup Step 2/3"); DEBUG_HEAP();
        tlv_t* device_public_key = tlv_get_value(message, TLVType_PublicKey);
        if(!device_public_key)
        {
          CLIENT_ERROR(context, "Invalid payload: no device public key");
          send_tlv_error_response(context, 4, TLVError_Authentication);
          break;
        }

        tlv_t* proof = tlv_get_value(message, TLVType_Proof);
        if(!proof)
        {
          CLIENT_ERROR(context, "Invalid payload: no device proof");
          send_tlv_error_response(context, 4, TLVError_Authentication);
          break;
        }
        CLIENT_DEBUG(context, "Computing SRP shared secret");
        DEBUG_HEAP();
        watchdog_disable_all();
        watchdog_check_begin();
        int r = crypto_srp_compute_key(context->server->pairing_context->srp,
          device_public_key->value, device_public_key->size,
          context->server->pairing_context->public_key,
          context->server->pairing_context->public_key_size);
        watchdog_check_end("crypto_srp_compute_key"); // 13479ms
        watchdog_enable_all();

        delay(10);

        if(r)
        {
          CLIENT_ERROR(context, "Failed to compute SRP shared secret (code %d)", r);
          send_tlv_error_response(context, 4, TLVError_Authentication);
          break;
        }

        free(context->server->pairing_context->public_key);
        context->server->pairing_context->public_key = NULL;
        context->server->pairing_context->public_key_size = 0;

        CLIENT_DEBUG(context, "Verifying peer's proof");

        //watchdog_check_begin();
        r = crypto_srp_verify(context->server->pairing_context->srp, proof->value, proof->size);
        //watchdog_check_end("crypto_srp_verify");// 1ms

        if(r)
        {
          CLIENT_ERROR(context, "Failed to verify peer's proof (code %d)", r);
          send_tlv_error_response(context, 4, TLVError_Authentication);
          break;
        }
        CLIENT_DEBUG(context, "Generating own proof");
        size_t server_proof_size = 0;
        crypto_srp_get_proof(context->server->pairing_context->srp, NULL, &server_proof_size);

        byte* server_proof = (byte*)malloc(server_proof_size);
        //watchdog_check_begin();
        r = crypto_srp_get_proof(context->server->pairing_context->srp, server_proof,
          &server_proof_size);
        //watchdog_check_end("crypto_srp_get_proof");// 1ms

        tlv_values_t* response = tlv_new();
        tlv_add_integer_value(response, TLVType_State, 1, 4);
        tlv_add_value(response, TLVType_Proof, server_proof, server_proof_size);
        free(server_proof);
        send_tlv_response(context, response);
        context->step = HOMEKIT_CLIENT_STEP_PAIR_SETUP_2OF3;
        break;
      }
    case 5:
      {
        CLIENT_INFO(context, "Pair Setup Step 3/3"); DEBUG_HEAP();
        int r;
        byte shared_secret[HKDF_HASH_SIZE];
        size_t shared_secret_size = sizeof(shared_secret);

        CLIENT_DEBUG(context, "Calculating shared secret");
        const char salt1[] = "Pair-Setup-Encrypt-Salt";
        const char info1[] = "Pair-Setup-Encrypt-Info";

