HolgerBurkarth/HomeKit-ESP8266/src/arduino_homekit_server.cpp
        r = crypto_srp_hkdf(context->server->pairing_context->srp, (byte*)salt1, sizeof(salt1) - 1,
          (byte*)info1, sizeof(info1) - 1, shared_secret, &shared_secret_size);
        if(r)
        {
          CLIENT_ERROR(context, "Failed to generate shared secret (code %d)", r);
          send_tlv_error_response(context, 6, TLVError_Authentication);
          break;
        }

        tlv_t* tlv_encrypted_data = tlv_get_value(message, TLVType_EncryptedData);
        if(!tlv_encrypted_data)
        {
          CLIENT_ERROR(context, "Invalid payload: no encrypted data");
          send_tlv_error_response(context, 6, TLVError_Authentication);
          break;
        }

        CLIENT_DEBUG(context, "Decrypting payload");
        size_t decrypted_data_size = 0;
        crypto_chacha20poly1305_decrypt(shared_secret, (const byte*)"\x0\x0\x0\x0PS-Msg05", NULL, 0,
          tlv_encrypted_data->value, tlv_encrypted_data->size,
          NULL, &decrypted_data_size);

        byte* decrypted_data = (byte*)malloc(decrypted_data_size);
        // TODO: check malloc result
        r = crypto_chacha20poly1305_decrypt(shared_secret, (const byte*)"\x0\x0\x0\x0PS-Msg05", NULL, 0,
          tlv_encrypted_data->value, tlv_encrypted_data->size, decrypted_data,
          &decrypted_data_size);
        if(r)
        {
          CLIENT_ERROR(context, "Failed to decrypt data (code %d)", r);

          free(decrypted_data);

          send_tlv_error_response(context, 6, TLVError_Authentication);
          break;
        }

        tlv_values_t* decrypted_message = tlv_new();
        r = tlv_parse(decrypted_data, decrypted_data_size, decrypted_message);
        if(r)
        {
          CLIENT_ERROR(context, "Failed to parse decrypted TLV (code %d)", r);

          tlv_free(decrypted_message);
          free(decrypted_data);

          send_tlv_error_response(context, 6, TLVError_Authentication);
          break;
        }

        free(decrypted_data);

        tlv_t* tlv_device_id = tlv_get_value(decrypted_message, TLVType_Identifier);
        if(!tlv_device_id)
        {
          CLIENT_ERROR(context, "Invalid encrypted payload: no device identifier");

          tlv_free(decrypted_message);

          send_tlv_error_response(context, 6, TLVError_Authentication);
          break;
        }

        // TODO: check that tlv_device_id->size == 36

        tlv_t* tlv_device_public_key = tlv_get_value(decrypted_message, TLVType_PublicKey);
        if(!tlv_device_public_key)
        {
          CLIENT_ERROR(context, "Invalid encrypted payload: no device public key");

          tlv_free(decrypted_message);

          send_tlv_error_response(context, 6, TLVError_Authentication);
          break;
        }

        tlv_t* tlv_device_signature = tlv_get_value(decrypted_message, TLVType_Signature);
        if(!tlv_device_signature)
        {
          CLIENT_ERROR(context, "Invalid encrypted payload: no device signature");

          tlv_free(decrypted_message);

          send_tlv_error_response(context, 6, TLVError_Authentication);
          break;
        }

        CLIENT_DEBUG(context, "Importing device public key");

        ed25519_key device_key;
        crypto_ed25519_init(&device_key);

        r = crypto_ed25519_import_public_key(&device_key, tlv_device_public_key->value,
          tlv_device_public_key->size);
        if(r)
        {
          CLIENT_ERROR(context, "Failed to import device public Key (code %d)", r);

          tlv_free(decrypted_message);

          send_tlv_error_response(context, 6, TLVError_Authentication);
          break;
        }

        byte device_x[HKDF_HASH_SIZE];
        size_t device_x_size = sizeof(device_x);

        CLIENT_DEBUG(context, "Calculating DeviceX");
        const char salt2[] = "Pair-Setup-Controller-Sign-Salt";
        const char info2[] = "Pair-Setup-Controller-Sign-Info";

        r = crypto_srp_hkdf(context->server->pairing_context->srp, (byte*)salt2, sizeof(salt2) - 1,
          (byte*)info2, sizeof(info2) - 1, device_x, &device_x_size);
        if(r)
        {
          CLIENT_ERROR(context, "Failed to generate DeviceX (code %d)", r);

          tlv_free(decrypted_message);

          send_tlv_error_response(context, 6, TLVError_Authentication);
          break;
        }

        size_t device_info_size = device_x_size + tlv_device_id->size + tlv_device_public_key->size;
        byte* device_info = (byte*)malloc(device_info_size);
        memcpy(device_info, device_x, device_x_size);
        memcpy(device_info + device_x_size, tlv_device_id->value, tlv_device_id->size);
        memcpy(device_info + device_x_size + tlv_device_id->size, tlv_device_public_key->value,
          tlv_device_public_key->size);

        CLIENT_DEBUG(context, "Verifying device signature");
        r = crypto_ed25519_verify(&device_key, device_info, device_info_size,
          tlv_device_signature->value, tlv_device_signature->size);
        if(r)
        {
          CLIENT_ERROR(context, "Failed to generate DeviceX (code %d)", r);

          free(device_info);
          tlv_free(decrypted_message);

          send_tlv_error_response(context, 6, TLVError_Authentication);
          break;
        }

        free(device_info);

        r = homekit_storage_add_pairing((const char*)tlv_device_id->value, &device_key,
          pairing_permissions_admin);
        if(r)
        {
          CLIENT_ERROR(context, "Failed to store pairing (code %d)", r);

          tlv_free(decrypted_message);
          send_tlv_error_response(context, 6, TLVError_Unknown);
          break;
        }

        char* device_id = strndup((const char*)tlv_device_id->value, tlv_device_id->size);
        VERBOSE("Added pairing with %s", device_id);
        free(device_id);

        tlv_free(decrypted_message);

        HOMEKIT_NOTIFY_EVENT(context->server, HOMEKIT_EVENT_PAIRING_ADDED);

        CLIENT_DEBUG(context, "Exporting accessory public key");
        size_t accessory_public_key_size = 0;

        crypto_ed25519_export_public_key(&context->server->accessory_key, NULL,
          &accessory_public_key_size);

        byte* accessory_public_key = (byte*)malloc(accessory_public_key_size);
        r = crypto_ed25519_export_public_key(&context->server->accessory_key, accessory_public_key,
          &accessory_public_key_size);
        if(r)
        {
          CLIENT_ERROR(context, "Failed to export accessory public key (code %d)", r);

          free(accessory_public_key);

          send_tlv_error_response(context, 6, TLVError_Authentication);
          break;
        }

