HolgerBurkarth/HomeKit-ESP8266/src/arduino_homekit_server.cpp
        size_t accessory_id_size = sizeof(context->server->accessory_id) - 1;
        size_t accessory_info_size = HKDF_HASH_SIZE + accessory_id_size + accessory_public_key_size;
        byte* accessory_info = (byte*)malloc(accessory_info_size);

        CLIENT_DEBUG(context, "Calculating AccessoryX");
        size_t accessory_x_size = accessory_info_size;
        const char salt3[] = "Pair-Setup-Accessory-Sign-Salt";
        const char info3[] = "Pair-Setup-Accessory-Sign-Info";
        r = crypto_srp_hkdf(context->server->pairing_context->srp, (byte*)salt3, sizeof(salt3) - 1,
          (byte*)info3, sizeof(info3) - 1, accessory_info, &accessory_x_size);
        if(r)
        {
          CLIENT_ERROR(context, "Failed to generate AccessoryX (code %d)", r);

          free(accessory_info);
          free(accessory_public_key);

          send_tlv_error_response(context, 6, TLVError_Unknown);
          break;
        }

        memcpy(accessory_info + accessory_x_size, context->server->accessory_id, accessory_id_size);
        memcpy(accessory_info + accessory_x_size + accessory_id_size, accessory_public_key,
          accessory_public_key_size);

        CLIENT_DEBUG(context, "Generating accessory signature"); DEBUG_HEAP();
        size_t accessory_signature_size = 0;
        crypto_ed25519_sign(&context->server->accessory_key, accessory_info, accessory_info_size,
          NULL, &accessory_signature_size);

        byte* accessory_signature = (byte*)malloc(accessory_signature_size);
        r = crypto_ed25519_sign(&context->server->accessory_key, accessory_info,
          accessory_info_size, accessory_signature, &accessory_signature_size);

        if(r)
        {
          CLIENT_ERROR(context, "Failed to generate accessory signature (code %d)", r);

          free(accessory_signature);
          free(accessory_public_key);
          free(accessory_info);

          send_tlv_error_response(context, 6, TLVError_Unknown);
          break;
        }

        free(accessory_info);

        tlv_values_t* response_message = tlv_new();
        tlv_add_value(response_message, TLVType_Identifier, (byte*)context->server->accessory_id,
          accessory_id_size);
        tlv_add_value(response_message, TLVType_PublicKey, accessory_public_key,
          accessory_public_key_size);
        tlv_add_value(response_message, TLVType_Signature, accessory_signature,
          accessory_signature_size);

        free(accessory_public_key);
        free(accessory_signature);

        size_t response_data_size = 0;
        TLV_DEBUG(response_message);

        tlv_format(response_message, NULL, &response_data_size);

        byte* response_data = (byte*)malloc(response_data_size);
        r = tlv_format(response_message, response_data, &response_data_size);
        if(r)
        {
          CLIENT_ERROR(context, "Failed to format TLV response (code %d)", r);

          free(response_data);
          tlv_free(response_message);

          send_tlv_error_response(context, 6, TLVError_Unknown);
          break;
        }

        tlv_free(response_message);

        CLIENT_DEBUG(context, "Encrypting response");
        size_t encrypted_response_data_size = 0;
        crypto_chacha20poly1305_encrypt(shared_secret, (byte*)"\x0\x0\x0\x0PS-Msg06", NULL, 0,
          response_data, response_data_size,
          NULL, &encrypted_response_data_size);

        byte* encrypted_response_data = (byte*)malloc(encrypted_response_data_size);
        r = crypto_chacha20poly1305_encrypt(shared_secret, (byte*)"\x0\x0\x0\x0PS-Msg06", NULL, 0,
          response_data, response_data_size, encrypted_response_data,
          &encrypted_response_data_size);

        free(response_data);

        if(r)
        {
          CLIENT_ERROR(context, "Failed to encrypt response data (code %d)", r);

          free(encrypted_response_data);

          send_tlv_error_response(context, 6, TLVError_Unknown);
          break;
        }

        tlv_values_t* response = tlv_new();
        tlv_add_integer_value(response, TLVType_State, 1, 6);
        tlv_add_value(response, TLVType_EncryptedData, encrypted_response_data,
          encrypted_response_data_size);

        free(encrypted_response_data);
        send_tlv_response(context, response);

        pairing_context_free(context->server->pairing_context);
        context->server->pairing_context = NULL;
        context->server->paired = true;
        CLIENT_INFO(context, "Successfully paired");
        //homekit_setup_mdns(context->server);
        context->step = HOMEKIT_CLIENT_STEP_PAIR_SETUP_3OF3;
        break;
      }
    default:
      {
        CLIENT_ERROR(context, "Unknown state: %d",
          tlv_get_integer_value(message, TLVType_State, -1));
      }
  }

  tlv_free(message);
  DEBUG_TIME_END("pair_setup");

  #ifdef HOMEKIT_OVERCLOCK_PAIR_SETUP
  homekit_overclock_end();
  #endif
}

#pragma endregion

#pragma region homekit_server_on_pair_verify
void homekit_server_on_pair_verify(client_context_t* context, const byte* data, size_t size)
{
  DEBUG("HomeKit Pair Verify"); DEBUG_HEAP();
  DEBUG_TIME_BEGIN();

  context->step = HOMEKIT_CLIENT_STEP_NONE;

  #ifdef HOMEKIT_OVERCLOCK_PAIR_VERIFY
  homekit_overclock_start();
  #endif

  tlv_values_t* message = tlv_new();
  tlv_parse(data, size, message);

  TLV_DEBUG(message);
  int r;
  switch(tlv_get_integer_value(message, TLVType_State, -1))
  {
    case 1:
      {
        CLIENT_INFO(context, "Pair Verify Step 1/2");
        CLIENT_DEBUG(context, "Importing device Curve25519 public key");
        tlv_t* tlv_device_public_key = tlv_get_value(message, TLVType_PublicKey);
        if(!tlv_device_public_key)
        {
          CLIENT_ERROR(context, "Device Curve25519 public key not found");
          send_tlv_error_response(context, 2, TLVError_Unknown);
          break;
        }
        curve25519_key device_key;
        r = crypto_curve25519_init(&device_key);
        if(r)
        {
          CLIENT_ERROR(context, "Failed to initialize device Curve25519 public key (code %d)", r);
          send_tlv_error_response(context, 2, TLVError_Unknown);
          break;
        }

        r = crypto_curve25519_import_public(&device_key, tlv_device_public_key->value,
          tlv_device_public_key->size);
        if(r)
        {
          CLIENT_ERROR(context, "Failed to import device Curve25519 public key (code %d)", r);
          crypto_curve25519_done(&device_key);
          send_tlv_error_response(context, 2, TLVError_Unknown);
          break;
        }
        CLIENT_DEBUG(context, "Generating accessory Curve25519 key");
        curve25519_key my_key;
        r = crypto_curve25519_generate(&my_key);
        if(r)
        {
          CLIENT_ERROR(context, "Failed to generate accessory Curve25519 key (code %d)", r);
          crypto_curve25519_done(&device_key);
          send_tlv_error_response(context, 2, TLVError_Unknown);
          break;
        }
        CLIENT_DEBUG(context, "Exporting accessory Curve25519 public key");
        size_t my_key_public_size = 0;
        crypto_curve25519_export_public(&my_key, NULL, &my_key_public_size);

        byte* my_key_public = (byte*)malloc(my_key_public_size);
        r = crypto_curve25519_export_public(&my_key, my_key_public, &my_key_public_size);
        if(r)
        {
          CLIENT_ERROR(context, "Failed to export accessory Curve25519 public key (code %d)", r);
          free(my_key_public);
          crypto_curve25519_done(&my_key);
          crypto_curve25519_done(&device_key);
          send_tlv_error_response(context, 2, TLVError_Unknown);
          break;
        }

        CLIENT_DEBUG(context, "Generating Curve25519 shared secret");
        size_t shared_secret_size = 0;
        crypto_curve25519_shared_secret(&my_key, &device_key, NULL, &shared_secret_size);

