HolgerBurkarth/HomeKit-ESP8266/src/arduino_homekit_server.cpp
        byte* shared_secret = (byte*)malloc(shared_secret_size);
        r = crypto_curve25519_shared_secret(&my_key, &device_key, shared_secret,
          &shared_secret_size);
        crypto_curve25519_done(&my_key);
        crypto_curve25519_done(&device_key);

        if(r)
        {
          CLIENT_ERROR(context, "Failed to generate Curve25519 shared secret (code %d)", r);
          free(shared_secret);
          free(my_key_public);
          send_tlv_error_response(context, 2, TLVError_Unknown);
          break;
        }

        CLIENT_DEBUG(context, "Generating signature");
        size_t accessory_id_size = sizeof(context->server->accessory_id) - 1;
        size_t accessory_info_size = my_key_public_size + accessory_id_size
          + tlv_device_public_key->size;

        byte* accessory_info = (byte*)malloc(accessory_info_size);
        memcpy(accessory_info, my_key_public, my_key_public_size);
        memcpy(accessory_info + my_key_public_size, context->server->accessory_id,
          accessory_id_size);
        memcpy(accessory_info + my_key_public_size + accessory_id_size,
          tlv_device_public_key->value, tlv_device_public_key->size);

        size_t accessory_signature_size = 0;
        crypto_ed25519_sign(&context->server->accessory_key, accessory_info, accessory_info_size,
          NULL, &accessory_signature_size);

        byte* accessory_signature = (byte*)malloc(accessory_signature_size);
        r = crypto_ed25519_sign(&context->server->accessory_key, accessory_info,
          accessory_info_size, accessory_signature, &accessory_signature_size);
        free(accessory_info);
        if(r)
        {
          CLIENT_ERROR(context, "Failed to generate signature (code %d)", r);
          free(accessory_signature);
          free(shared_secret);
          free(my_key_public);
          send_tlv_error_response(context, 2, TLVError_Unknown);
          break;
        }

        tlv_values_t* sub_response = tlv_new();
        tlv_add_value(sub_response, TLVType_Identifier, (const byte*)context->server->accessory_id,
          accessory_id_size);
        tlv_add_value(sub_response, TLVType_Signature, accessory_signature,
          accessory_signature_size);

        free(accessory_signature);

        size_t sub_response_data_size = 0;
        tlv_format(sub_response, NULL, &sub_response_data_size);

        byte* sub_response_data = (byte*)malloc(sub_response_data_size);
        r = tlv_format(sub_response, sub_response_data, &sub_response_data_size);
        tlv_free(sub_response);

        if(r)
        {
          CLIENT_ERROR(context, "Failed to format sub-TLV message (code %d)", r);
          free(sub_response_data);
          free(shared_secret);
          free(my_key_public);
          send_tlv_error_response(context, 2, TLVError_Unknown);
          break;
        }

        CLIENT_DEBUG(context, "Generating proof");
        size_t session_key_size = 0;
        const byte salt[] = "Pair-Verify-Encrypt-Salt";
        const byte info[] = "Pair-Verify-Encrypt-Info";
        crypto_hkdf(shared_secret, shared_secret_size, salt, sizeof(salt) - 1, info,
          sizeof(info) - 1,
          NULL, &session_key_size);

        byte* session_key = (byte*)malloc(session_key_size);
        r = crypto_hkdf(shared_secret, shared_secret_size, salt, sizeof(salt) - 1, info,
          sizeof(info) - 1, session_key, &session_key_size);
        if(r)
        {
          CLIENT_ERROR(context, "Failed to derive session key (code %d)", r);
          free(session_key);
          free(sub_response_data);
          free(shared_secret);
          free(my_key_public);
          send_tlv_error_response(context, 2, TLVError_Unknown);
          break;
        }

        CLIENT_DEBUG(context, "Encrypting response");
        size_t encrypted_response_data_size = 0;
        crypto_chacha20poly1305_encrypt(session_key, (byte*)"\x0\x0\x0\x0PV-Msg02", NULL, 0,
          sub_response_data, sub_response_data_size,
          NULL, &encrypted_response_data_size);

        byte* encrypted_response_data = (byte*)malloc(encrypted_response_data_size);
        r = crypto_chacha20poly1305_encrypt(session_key, (byte*)"\x0\x0\x0\x0PV-Msg02", NULL, 0,
          sub_response_data, sub_response_data_size, encrypted_response_data,
          &encrypted_response_data_size);
        free(sub_response_data);

        if(r)
        {
          CLIENT_ERROR(context, "Failed to encrypt sub response data (code %d)", r);
          free(encrypted_response_data);
          free(session_key);
          free(shared_secret);
          free(my_key_public);
          send_tlv_error_response(context, 2, TLVError_Unknown);
          break;
        }

        tlv_values_t* response = tlv_new();
        tlv_add_integer_value(response, TLVType_State, 1, 2);
        tlv_add_value(response, TLVType_PublicKey, my_key_public, my_key_public_size);
        tlv_add_value(response, TLVType_EncryptedData, encrypted_response_data,
          encrypted_response_data_size);

        free(encrypted_response_data);

        send_tlv_response(context, response);

        if(context->verify_context)
          pair_verify_context_free(context->verify_context);

        context->verify_context = pair_verify_context_new();
        context->verify_context->secret = shared_secret;
        context->verify_context->secret_size = shared_secret_size;

        context->verify_context->session_key = session_key;
        context->verify_context->session_key_size = session_key_size;

        context->verify_context->accessory_public_key = my_key_public;
        context->verify_context->accessory_public_key_size = my_key_public_size;

        context->verify_context->device_public_key = (byte*)malloc(tlv_device_public_key->size);
        memcpy(context->verify_context->device_public_key, tlv_device_public_key->value,
          tlv_device_public_key->size);
        context->verify_context->device_public_key_size = tlv_device_public_key->size;
        context->step = HOMEKIT_CLIENT_STEP_PAIR_VERIFY_1OF2;
        break;
      }
    case 3:
      {
        CLIENT_INFO(context, "Pair Verify Step 2/2");

        if(!context->verify_context)
        {
          CLIENT_ERROR(context, "Failed to verify: no state 1 data");
          send_tlv_error_response(context, 4, TLVError_Authentication);
          break;
        }

        tlv_t* tlv_encrypted_data = tlv_get_value(message, TLVType_EncryptedData);
        if(!tlv_encrypted_data)
        {
          CLIENT_ERROR(context, "Failed to verify: no encrypted data");
          pair_verify_context_free(context->verify_context);
          context->verify_context = NULL;
          send_tlv_error_response(context, 4, TLVError_Authentication);
          break;
        }

        CLIENT_DEBUG(context, "Decrypting payload");
        size_t decrypted_data_size = 0;
        crypto_chacha20poly1305_decrypt(context->verify_context->session_key,
          (byte*)"\x0\x0\x0\x0PV-Msg03", NULL, 0, tlv_encrypted_data->value,
          tlv_encrypted_data->size,
          NULL, &decrypted_data_size);

        byte* decrypted_data = (byte*)malloc(decrypted_data_size);
        r = crypto_chacha20poly1305_decrypt(context->verify_context->session_key,
          (byte*)"\x0\x0\x0\x0PV-Msg03", NULL, 0, tlv_encrypted_data->value,
          tlv_encrypted_data->size, decrypted_data, &decrypted_data_size);
        if(r)
        {
          CLIENT_ERROR(context, "Failed to decrypt data (code %d)", r);
          free(decrypted_data);
          pair_verify_context_free(context->verify_context);
          context->verify_context = NULL;
          send_tlv_error_response(context, 4, TLVError_Authentication);
          break;
        }

        tlv_values_t* decrypted_message = tlv_new();
        r = tlv_parse(decrypted_data, decrypted_data_size, decrypted_message);
        free(decrypted_data);

        if(r)
        {
          CLIENT_ERROR(context, "Failed to parse decrypted TLV (code %d)", r);
          tlv_free(decrypted_message);
          pair_verify_context_free(context->verify_context);
          context->verify_context = NULL;
          send_tlv_error_response(context, 4, TLVError_Authentication);
          break;
        }

        tlv_t* tlv_device_id = tlv_get_value(decrypted_message, TLVType_Identifier);
        if(!tlv_device_id)
        {
          CLIENT_ERROR(context, "Invalid encrypted payload: no device identifier");
          tlv_free(decrypted_message);
          pair_verify_context_free(context->verify_context);
          context->verify_context = NULL;
          send_tlv_error_response(context, 4, TLVError_Authentication);
          break;
        }

        tlv_t* tlv_device_signature = tlv_get_value(decrypted_message, TLVType_Signature);
        if(!tlv_device_signature)
        {
          CLIENT_ERROR(context, "Invalid encrypted payload: no device identifier");
          tlv_free(decrypted_message);
          pair_verify_context_free(context->verify_context);
          context->verify_context = NULL;
          send_tlv_error_response(context, 4, TLVError_Authentication);
          break;
        }

