HolgerBurkarth/HomeKit-ESP8266/src/arduino_homekit_server.cpp
        char* device_id = strndup((const char*)tlv_device_id->value, tlv_device_id->size);
        CLIENT_DEBUG(context, "Searching pairing with %s", device_id);
        pairing_t pairing;
        if(homekit_storage_find_pairing(device_id, &pairing))
        {
          CLIENT_ERROR(context, "No pairing for %s found", device_id);
          free(device_id);
          tlv_free(decrypted_message);
          pair_verify_context_free(context->verify_context);
          context->verify_context = NULL;
          send_tlv_error_response(context, 4, TLVError_Authentication);
          break;
        }

        CLIENT_INFO(context, "Found pairing with %s", device_id);
        free(device_id);

        byte permissions = pairing.permissions;
        int pairing_id = pairing.id;

        size_t device_info_size = context->verify_context->device_public_key_size
          + context->verify_context->accessory_public_key_size + tlv_device_id->size;
        byte* device_info = (byte*)malloc(device_info_size);
        memcpy(device_info, context->verify_context->device_public_key,
          context->verify_context->device_public_key_size);
        memcpy(device_info + context->verify_context->device_public_key_size, tlv_device_id->value,
          tlv_device_id->size);
        memcpy(device_info + context->verify_context->device_public_key_size + tlv_device_id->size,
          context->verify_context->accessory_public_key,
          context->verify_context->accessory_public_key_size);

        CLIENT_DEBUG(context, "Verifying device signature");
        r = crypto_ed25519_verify(&pairing.device_key, device_info, device_info_size,
          tlv_device_signature->value, tlv_device_signature->size);
        free(device_info);
        tlv_free(decrypted_message);

        if(r)
        {
          CLIENT_ERROR(context, "Failed to verify device signature (code %d)", r);
          pair_verify_context_free(context->verify_context);
          context->verify_context = NULL;
          send_tlv_error_response(context, 4, TLVError_Authentication);
          break;
        }

        const byte salt[] = "Control-Salt";
        size_t read_key_size = sizeof(context->read_key);
        const byte read_info[] = "Control-Read-Encryption-Key";
        r = crypto_hkdf(context->verify_context->secret, context->verify_context->secret_size, salt,
          sizeof(salt) - 1, read_info, sizeof(read_info) - 1, context->read_key,
          &read_key_size);
        if(r)
        {
          CLIENT_ERROR(context, "Failed to derive read encryption key (code %d)", r);
          pair_verify_context_free(context->verify_context);
          context->verify_context = NULL;
          send_tlv_error_response(context, 4, TLVError_Unknown);
          break;
        }

        size_t write_key_size = sizeof(context->write_key);
        const byte write_info[] = "Control-Write-Encryption-Key";

        r = crypto_hkdf(context->verify_context->secret, context->verify_context->secret_size, salt,
          sizeof(salt) - 1, write_info, sizeof(write_info) - 1, context->write_key,
          &write_key_size);

        pair_verify_context_free(context->verify_context);
        context->verify_context = NULL;

        if(r)
        {
          CLIENT_ERROR(context, "Failed to derive write encryption key (code %d)", r);
          send_tlv_error_response(context, 4, TLVError_Unknown);
          break;
        }

        tlv_values_t* response = tlv_new();
        tlv_add_integer_value(response, TLVType_State, 1, 4);
        send_tlv_response(context, response);

        context->pairing_id = pairing_id;
        context->permissions = permissions;
        context->encrypted = true;

        HOMEKIT_NOTIFY_EVENT(context->server, HOMEKIT_EVENT_CLIENT_VERIFIED);
        CLIENT_INFO(context, "Verification successful, secure session established");
        context->step = HOMEKIT_CLIENT_STEP_PAIR_VERIFY_2OF2;
        break;
      }
    default:
      {
        CLIENT_ERROR(context, "Unknown state: %d",
          tlv_get_integer_value(message, TLVType_State, -1));
      }
  }
  tlv_free(message);
  DEBUG_TIME_END("pair_verify");
  INFO_HEAP();

  #ifdef HOMEKIT_OVERCLOCK_PAIR_VERIFY
  homekit_overclock_end();
  #endif
}

#pragma endregion

#pragma region homekit_server_on_get_accessories
void homekit_server_on_get_accessories(client_context_t* context)
{
  DEBUG_TIME_BEGIN();
  CLIENT_INFO(context, "Get Accessories"); DEBUG_HEAP();
  client_send_P(context, json_200_response_headers_progmem);

  CLIENT_DEBUG(context, "Get Accessories, start send json body");

  json_stream* json = json_new(HOMEKIT_JSONBUFFER_SIZE, client_send_chunk, context);
  json_object_start(json);
  json_string(json, "accessories");
  json_array_start(json);

  for(homekit_accessory_t** accessory_it = const_cast<homekit_accessory_t**>(context->server->config->accessories);
    *accessory_it;
    ++accessory_it)
  {

    homekit_accessory_t* accessory = *accessory_it;

    json_object_start(json);

    json_string(json, "aid");
    json_uint32(json, accessory->id);
    json_string(json, "services");
    json_array_start(json);

    for(homekit_service_t** service_it = const_cast<homekit_service_t**>(accessory->services);
      *service_it;
      ++service_it)
    {
      homekit_service_t* service = *service_it;

      json_object_start(json);

      json_string(json, "iid");
      json_uint32(json, service->id);
      json_string(json, "type");
      json_string(json, service->type);
      json_string(json, "hidden");
      json_boolean(json, service->hidden);
      json_string(json, "primary");
      json_boolean(json, service->primary);
      if(service->linked)
      {
        json_string(json, "linked");
        json_array_start(json);
        for(homekit_service_t** linked = service->linked; *linked; linked++)
        {
          json_uint32(json, (*linked)->id);
        }
        json_array_end(json);
      }

      json_string(json, "characteristics");
      json_array_start(json);

