HolgerBurkarth/HomeKit-ESP8266/src/arduino_homekit_server.cpp
      for(homekit_characteristic_t** ch_it = const_cast<homekit_characteristic_t**>(service->characteristics); *ch_it; ch_it++)
      {
        homekit_characteristic_t* ch = *ch_it;

        json_object_start(json);
        write_characteristic_json(json, context, ch,
          (characteristic_format_t)(characteristic_format_type
            | characteristic_format_meta | characteristic_format_perms
            | characteristic_format_events),
          NULL);
        json_object_end(json);
      }

      json_array_end(json);
      json_object_end(json); // service
    }

    json_array_end(json);
    json_object_end(json); // accessory
  }

  json_array_end(json);
  json_object_end(json); // response

  json_flush(json);
  json_free(json);

  client_send_chunk(NULL, 0, context);
  DEBUG_TIME_END("get_accessories")
}

#pragma endregion

#pragma region bool_endpoint_param
bool bool_endpoint_param(const char* name, client_context_t* context)
{
  query_param_t* param = query_params_find(context->endpoint_params, name);
  return param && param->value && !strcmp(param->value, "1");
}

#pragma endregion

#pragma region write_characteristic_error
void write_characteristic_error(json_stream* json, uint32_t aid, uint32_t iid, int status)
{
  json_object_start(json);
  json_string(json, "aid");
  json_uint32(json, aid);
  json_string(json, "iid");
  json_uint32(json, iid);
  json_string(json, "status");
  json_uint8(json, status);
  json_object_end(json);
}

#pragma endregion

#pragma region homekit_server_on_get_characteristics
void homekit_server_on_get_characteristics(client_context_t* context)
{
  CLIENT_DEBUG(context, "Get Characteristics"); DEBUG_HEAP();

  query_param_t* qp = context->endpoint_params;
  while(qp)
  {
    CLIENT_DEBUG(context, "Query parameter %s = %s", qp->name, qp->value);
    qp = qp->next;
  }

  query_param_t* id_param = query_params_find(context->endpoint_params, "id");
  if(!id_param)
  {
    CLIENT_ERROR(context, "Invalid get characteristics request: missing ID parameter");
    send_json_error_response(context, 400, HAPStatus_InvalidValue);
    return;
  }

  characteristic_format_t format = (characteristic_format_t)0;
  if(bool_endpoint_param("meta", context))
    format = (characteristic_format_t)(format | characteristic_format_meta);

  if(bool_endpoint_param("perms", context))
    format = (characteristic_format_t)(format | characteristic_format_perms);

  if(bool_endpoint_param("type", context))
    format = (characteristic_format_t)(format | characteristic_format_type);

  if(bool_endpoint_param("ev", context))
    format = (characteristic_format_t)(format | characteristic_format_events);

  bool success = true;

  char* id = strdup(id_param->value);
  char* ch_id;
  char* _id = id;
  while((ch_id = strsep(&_id, ",")))
  {
    char* dot = strstr(ch_id, ".");
    if(!dot)
    {
      send_json_error_response(context, 400, HAPStatus_InvalidValue);
      free(id);
      return;
    }

    *dot = 0;
    uint32_t aid = atoi(ch_id);
    uint32_t iid = atoi(dot + 1);

    CLIENT_DEBUG(context, "Requested characteristic info for %u.%u", aid, iid);
    homekit_characteristic_t* ch = homekit_characteristic_by_aid_and_iid(
      context->server->config->accessories, aid, iid);
    if(!ch)
    {
      success = false;
      continue;
    }

    if(!(ch->permissions & homekit_permissions_paired_read))
    {
      success = false;
      continue;
    }
  }

  free(id);
  id = strdup(id_param->value);

  if(success)
  {
    client_send_P(context, json_200_response_headers_progmem);
  }
  else
  {
    client_send_P(context, json_207_response_headers_progmem);
  }

  json_stream* json = json_new(HOMEKIT_JSONBUFFER_SIZE, client_send_chunk, context);
  json_object_start(json);
  json_string(json, "characteristics");
  json_array_start(json);

  _id = id;
  while((ch_id = strsep(&_id, ",")))
  {
    char* dot = strstr(ch_id, ".");
    *dot = 0;
    uint32_t aid = atoi(ch_id);
    uint32_t iid = atoi(dot + 1);

    CLIENT_DEBUG(context, "Requested characteristic info for %d.%d", aid, iid);
    homekit_characteristic_t* ch = homekit_characteristic_by_aid_and_iid(
      context->server->config->accessories, aid, iid);
    if(!ch)
    {
      write_characteristic_error(json, aid, iid, HAPStatus_NoResource);
      continue;
    }

    if(!(ch->permissions & homekit_permissions_paired_read))
    {
      write_characteristic_error(json, aid, iid, HAPStatus_WriteOnly);
      continue;
    }

    json_object_start(json);
    write_characteristic_json(json, context, ch, format, NULL);
    if(!success)
    {
      json_string(json, "status");
      json_uint8(json, HAPStatus_Success);
    }
    json_object_end(json);
  }

  json_array_end(json);
  json_object_end(json); // response

  json_flush(json);
  json_free(json);

  client_send_chunk(NULL, 0, context);

  free(id);
}

#pragma endregion

#pragma region process_characteristics_update
HAPStatus process_characteristics_update(const cJSON* j_ch, client_context_t* context)
{
  cJSON* j_aid = cJSON_GetObjectItem(j_ch, "aid");
  if(!j_aid)
  {
    CLIENT_ERROR(context, "Failed to process request: no \"aid\" field");
    return HAPStatus_NoResource;
  }
  if(j_aid->type != cJSON_Number)
  {
    CLIENT_ERROR(context, "Failed to process request: \"aid\" field is not a number");
    return HAPStatus_NoResource;
  }

  cJSON* j_iid = cJSON_GetObjectItem(j_ch, "iid");
  if(!j_iid)
  {
    CLIENT_ERROR(context, "Failed to process request: no \"iid\" field");
    return HAPStatus_NoResource;
  }
  if(j_iid->type != cJSON_Number)
  {
    CLIENT_ERROR(context, "Failed to process request: \"iid\" field is not a number");
    return HAPStatus_NoResource;
  }

  uint32_t aid = (uint32_t)j_aid->valuedouble;//j_aid->valueint;
  uint32_t iid = (uint32_t)j_iid->valuedouble;//j_iid->valueint;

  homekit_characteristic_t* ch = homekit_characteristic_by_aid_and_iid(
    context->server->config->accessories, aid, iid);
  if(!ch)
  {
    CLIENT_ERROR(context,
      "Failed to process request to update %u.%u: " "no such characteristic", aid, iid);
    return HAPStatus_NoResource;
  }

