HolgerBurkarth/HomeKit-ESP8266/src/arduino_homekit_server.cpp
  cJSON* j_value = cJSON_GetObjectItem(j_ch, "value");
  if(j_value)
  {
    homekit_value_t h_value = HOMEKIT_NULL_CPP();

    if(!(ch->permissions & homekit_permissions_paired_write))
    {
      CLIENT_ERROR(context, "Failed to update %d.%d: no write permission", aid, iid);
      return HAPStatus_ReadOnly;
    }

    /* 2024-09-12 Holger Burkarth:
     * If the characteristic has a setter_ex function, we call it directly
     * instead of updating the value directly. This is to allow the setter
     * to perform additional validation or processing.
     *
     * Temporary zeroing of the function pointer prevents recurrence.
    */

    typedef void (*setter_ex)(homekit_characteristic_t* ch, const homekit_value_t value);
    setter_ex setter_func = ch->setter_ex;

    #define INVOKE_SETTER(ch, h_value) \
      ch->setter_ex = nullptr; \
      setter_func(ch, h_value); \
      ch->setter_ex = setter_func;

    switch(ch->format)
    {
      case homekit_format_bool:
        {
          bool value = false;
          if(j_value->type == cJSON_True)
          {
            value = true;
          }
          else if(j_value->type == cJSON_False)
          {
            value = false;
          }
          else if(j_value->type == cJSON_Number
            && (j_value->valueint == 0 || j_value->valueint == 1))
          {
            value = j_value->valueint == 1;
          }
          else
          {
            CLIENT_ERROR(context, "Failed to update %d.%d: value is not a boolean or 0/1", aid,
              iid);
            return HAPStatus_InvalidValue;
          }

          CLIENT_DEBUG(context, "Updating characteristic %d.%d with boolean %s", aid, iid, value ? "true" : "false");

          h_value = HOMEKIT_BOOL_CPP(value);
          if(ch->setter_ex)
          {
            INVOKE_SETTER(ch, h_value);
          }
          else
          {
            ch->value = h_value;
          }
          break;
        }
      case homekit_format_uint8:
      case homekit_format_uint16:
      case homekit_format_uint32:
      case homekit_format_uint64:
      case homekit_format_int:
        {
          // We accept boolean values here in order to fix a bug in HomeKit. HomeKit sometimes sends a boolean instead of an integer of value 0 or 1.
          if(j_value->type != cJSON_Number && j_value->type != cJSON_False
            && j_value->type != cJSON_True)
          {
            CLIENT_ERROR(context, "Failed to update %d.%d: value is not a number", aid, iid);
            return HAPStatus_InvalidValue;
          }

          double min_value = 0;
          double max_value = 0;

          switch(ch->format)
          {
            case homekit_format_uint8:
              {
                min_value = 0;
                max_value = 255;
                break;
              }
            case homekit_format_uint16:
              {
                min_value = 0;
                max_value = 65535;
                break;
              }
            case homekit_format_uint32:
              {
                min_value = 0;
                max_value = 4294967295;
                break;
              }
            case homekit_format_uint64:
              {
                min_value = 0;
                max_value = 18446744073709551615ULL;
                break;
              }
            case homekit_format_int:
              {
                min_value = -2147483648;
                max_value = 2147483647;
                break;
              }
            default:
              {
                // Impossible, keeping to make compiler happy
                break;
              }
          }

          if(ch->min_value)
            min_value = *ch->min_value;
          if(ch->max_value)
            max_value = *ch->max_value;

          double value = j_value->valuedouble;
          if(value < min_value || value > max_value)
          {
            CLIENT_ERROR(context, "Failed to update %d.%d: value %g is not in range %g..%g",
              aid, iid, value, min_value, max_value);
            return HAPStatus_InvalidValue;
          }

          if(ch->valid_values.count)
          {
            bool matches = false;
            int v = (int)value;
            for(int i = 0; i < ch->valid_values.count; i++)
            {
              if(v == ch->valid_values.values[i])
              {
                matches = true;
                break;
              }
            }

            if(!matches)
            {
              CLIENT_ERROR(context,
                "Failed to update %d.%d: value is not one of valid values", aid, iid);
              return HAPStatus_InvalidValue;
            }
          }

          if(ch->valid_values_ranges.count)
          {
            bool matches = false;
            for(int i = 0; i < ch->valid_values_ranges.count; i++)
            {
              if(value >= ch->valid_values_ranges.ranges[i].start
                && value <= ch->valid_values_ranges.ranges[i].end)
              {
                matches = true;
                break;
              }
            }

            if(!matches)
            {
              CLIENT_ERROR(context,
                "Failed to update %d.%d: value is not in valid values range", aid, iid);
              return HAPStatus_InvalidValue;
            }
          }

          CLIENT_DEBUG(context, "Updating characteristic %d.%d with integer %g", aid, iid, value);

          switch(ch->format)
          {
            case homekit_format_uint8:
              h_value = HOMEKIT_UINT8_CPP(value);
              break;
            case homekit_format_uint16:
              h_value = HOMEKIT_UINT16_CPP(value);
              break;
            case homekit_format_uint32:
              h_value = HOMEKIT_UINT32_CPP(value);
              break;
            case homekit_format_uint64:
              h_value = HOMEKIT_UINT64_CPP(value);
              break;
            case homekit_format_int:
              h_value = HOMEKIT_INT_CPP(value);
              break;

            default:
              CLIENT_ERROR(context, "Unexpected format when updating numeric value: %d",
                ch->format);
              return HAPStatus_InvalidValue;
          }

