HolgerBurkarth/HomeKit-ESP8266/src/arduino_homekit_server.cpp
          if(ch->setter_ex)
          {
            INVOKE_SETTER(ch, h_value);
          }
          else
          {
            ch->value = h_value;
          }
          break;
        }
      case homekit_format_float:
        {
          if(j_value->type != cJSON_Number)
          {
            CLIENT_ERROR(context, "Failed to update %d.%d: value is not a number", aid, iid);
            return HAPStatus_InvalidValue;
          }

          float value = j_value->valuedouble;
          if((ch->min_value && value < *ch->min_value)
            || (ch->max_value && value > *ch->max_value))
          {
            CLIENT_ERROR(context, "Failed to update %d.%d: value is not in range", aid, iid);
            return HAPStatus_InvalidValue;
          }

          CLIENT_DEBUG(context, "Updating characteristic %d.%d with %g", aid, iid, value);

          h_value = HOMEKIT_FLOAT_CPP(value);
          if(ch->setter_ex)
          {
            INVOKE_SETTER(ch, h_value);
          }
          else
          {
            ch->value = h_value;
          }
          break;
        }
      case homekit_format_string:
        {
          if(j_value->type != cJSON_String)
          {
            CLIENT_ERROR(context, "Failed to update %d.%d: value is not a string", aid, iid);
            return HAPStatus_InvalidValue;
          }

          int max_len = (ch->max_len) ? *ch->max_len : 64;

          char* value = j_value->valuestring;
          if(strlen(value) > max_len)
          {
            CLIENT_ERROR(context, "Failed to update %d.%d: value is too long", aid, iid);
            return HAPStatus_InvalidValue;
          }

          CLIENT_DEBUG(context, "Updating characteristic %d.%d with \"%s\"", aid, iid, value);

          h_value = HOMEKIT_STRING_CPP(value);
          if(ch->setter_ex)
          {
            INVOKE_SETTER(ch, h_value);
          }
          else
          {
            homekit_value_destruct(&ch->value);
            homekit_value_copy(&ch->value, &h_value);
          }
          break;
        }
      case homekit_format_tlv:
        {
          if(j_value->type != cJSON_String)
          {
            CLIENT_ERROR(context, "Failed to update %d.%d: value is not a string", aid, iid);
            return HAPStatus_InvalidValue;
          }

          int max_len = (ch->max_len) ? *ch->max_len : 256;

          char* value = j_value->valuestring;
          size_t value_len = strlen(value);
          if(value_len > max_len)
          {
            CLIENT_ERROR(context, "Failed to update %d.%d: value is too long", aid, iid);
            return HAPStatus_InvalidValue;
          }

          size_t tlv_size = base64_decoded_size((unsigned char*)value, value_len);
          byte* tlv_data = (byte*)malloc(tlv_size);
          if(base64_decode_((byte*)value, value_len, tlv_data) < 0)
          {
            free(tlv_data);
            CLIENT_ERROR(context, "Failed to update %d.%d: error Base64 decoding", aid, iid);
            return HAPStatus_InvalidValue;
          }

          tlv_values_t* tlv_values = tlv_new();
          int r = tlv_parse(tlv_data, tlv_size, tlv_values);
          free(tlv_data);

          if(r)
          {
            CLIENT_ERROR(context, "Failed to update %d.%d: error parsing TLV", aid, iid);
            return HAPStatus_InvalidValue;
          }

          CLIENT_DEBUG(context, "Updating characteristic %d.%d with TLV:", aid, iid);
          for(tlv_t* t = tlv_values->head; t; t = t->next)
          {
            char* escaped_payload = binary_to_string(t->value, t->size);
            CLIENT_DEBUG(context, "  Type %d value (%d bytes): %s", t->type, t->size, escaped_payload);
            free(escaped_payload);
          }

          h_value = HOMEKIT_TLV_CPP(tlv_values);
          if(ch->setter_ex)
          {
            INVOKE_SETTER(ch, h_value);
          }
          else
          {
            homekit_value_destruct(&ch->value);
            homekit_value_copy(&ch->value, &h_value);
          }

          tlv_free(tlv_values);
          break;
        }
      case homekit_format_data:
        {
          if(j_value->type != cJSON_String)
          {
            CLIENT_ERROR(context, "Failed to update %d.%d: value is not a string", aid, iid);
            return HAPStatus_InvalidValue;
          }

          // Default max data len = 2,097,152 but that does not make sense
          // for this accessory
          int max_len = (ch->max_data_len) ? *ch->max_data_len : 4096;

          char* value = j_value->valuestring;
          size_t value_len = strlen(value);
          if(value_len > max_len)
          {
            CLIENT_ERROR(context, "Failed to update %d.%d: value is too long", aid, iid);
            return HAPStatus_InvalidValue;
          }

          size_t data_size = base64_decoded_size((unsigned char*)value, value_len);
          byte* data = (byte*)malloc(data_size);
          if(base64_decode_((byte*)value, value_len, data) < 0)
          {
            free(data);
            CLIENT_ERROR(context, "Failed to update %d.%d: error Base64 decoding", aid, iid);
            return HAPStatus_InvalidValue;
          }

          CLIENT_DEBUG(context, "Updating characteristic %d.%d with Data:", aid, iid);

          h_value = HOMEKIT_DATA_CPP(data, data_size);
          if(ch->setter_ex)
          {
            INVOKE_SETTER(ch, h_value);
          }
          else
          {
            homekit_value_destruct(&ch->value);
            homekit_value_copy(&ch->value, &h_value);
          }
          break;
        }
    }

    #undef INVOKE_SETTER

    if(!h_value.is_null)
    {
      context->current_characteristic = ch;
      context->current_value = &h_value;

      homekit_characteristic_notify(ch, h_value);

      context->current_characteristic = NULL;
      context->current_value = NULL;
    }
  }

  cJSON* j_events = cJSON_GetObjectItem(j_ch, "ev");
  if(j_events)
  {
    if(!(ch->permissions && homekit_permissions_notify))
    {
      CLIENT_ERROR(context,
        "Failed to set notification state for %d.%d: " "notifications are not supported",
        aid, iid);
      return HAPStatus_NotificationsUnsupported;
    }

    if((j_events->type != cJSON_True) && (j_events->type != cJSON_False))
    {
      CLIENT_ERROR(context,
        "Failed to set notification state for %d.%d: " "invalid state value", aid, iid);
    }

    if(j_events->type == cJSON_True)
    {
      homekit_characteristic_add_notify_callback(ch, client_notify_characteristic, context);
    }
    else
    {
      homekit_characteristic_remove_notify_callback(ch, client_notify_characteristic, context);
    }
  }

