HolgerBurkarth/HomeKit-ESP8266/src/arduino_homekit_server.cpp
  return HAPStatus_Success;
}

#pragma endregion

#pragma region homekit_server_on_update_characteristics
void homekit_server_on_update_characteristics(client_context_t* context, const byte* data, size_t size)
{
  DEBUG_TIME_BEGIN();
  CLIENT_DEBUG(context, "Update Characteristics"); DEBUG_HEAP();

  char* data1 = strndup((char*)data, size);
  cJSON* json = cJSON_Parse(data1);
  free(data1);

  if(!json)
  {
    CLIENT_ERROR(context, "Failed to parse request JSON");
    send_json_error_response(context, 400, HAPStatus_InvalidValue);
    return;
  }

  cJSON* characteristics = cJSON_GetObjectItem(json, "characteristics");
  if(!characteristics)
  {
    CLIENT_ERROR(context, "Failed to parse request: no \"characteristics\" field");
    cJSON_Delete(json);
    send_json_error_response(context, 400, HAPStatus_InvalidValue);
    return;
  }
  if(characteristics->type != cJSON_Array)
  {
    CLIENT_ERROR(context, "Failed to parse request: \"characteristics\" field is not an list");
    cJSON_Delete(json);
    send_json_error_response(context, 400, HAPStatus_InvalidValue);
    return;
  }

  HAPStatus* statuses = (HAPStatus*)malloc(
    sizeof(HAPStatus) * cJSON_GetArraySize(characteristics));
  bool has_errors = false;

  for(int i = 0; i < cJSON_GetArraySize(characteristics); i++)
  {

    cJSON* j_ch = cJSON_GetArrayItem(characteristics, i);

    char* s = cJSON_Print(j_ch);
    CLIENT_DEBUG(context, "Processing element %s", s);
    free(s);

    statuses[i] = process_characteristics_update(j_ch, context);

    if(statuses[i] != HAPStatus_Success)
      has_errors = true;
  }

  if(!has_errors)
  {
    CLIENT_DEBUG(context, "There were no processing errors, sending No Content response");

    send_204_response(context);
  }
  else
  {
    CLIENT_DEBUG(context, "There were processing errors, sending Multi-Status response");
    client_send_P(context, json_207_response_headers_progmem);

    json_stream* json1 = json_new(HOMEKIT_JSONBUFFER_SIZE, client_send_chunk, context);
    json_object_start(json1);
    json_string(json1, "characteristics");
    json_array_start(json1);

    for(int i = 0; i < cJSON_GetArraySize(characteristics); i++)
    {

      cJSON* j_ch = cJSON_GetArrayItem(characteristics, i);

      json_object_start(json1);
      json_string(json1, "aid");
      json_uint32(json1, cJSON_GetObjectItem(j_ch, "aid")->valuedouble);//->valueint);
      json_string(json1, "iid");
      json_uint32(json1, cJSON_GetObjectItem(j_ch, "iid")->valuedouble);//->valueint);
      json_string(json1, "status");
      json_uint8(json1, statuses[i]);
      json_object_end(json1);
    }

    json_array_end(json1);
    json_object_end(json1); // response

    json_flush(json1);
    json_free(json1);

    client_send_chunk(NULL, 0, context);
  }

  free(statuses);
  cJSON_Delete(json);
  DEBUG_TIME_END("update_characteristics");
}

#pragma endregion

#pragma region homekit_server_on_pairings
void homekit_server_on_pairings(client_context_t* context, const byte* data, size_t size)
{
  DEBUG("HomeKit Pairings"); DEBUG_HEAP();

  //context->step = HOMEKIT_CLIENT_STEP_PAIRINGS;
  tlv_values_t* message = tlv_new();
  tlv_parse(data, size, message);

  TLV_DEBUG(message);

  int r;

  if(tlv_get_integer_value(message, TLVType_State, -1) != 1)
  {
    send_tlv_error_response(context, 2, TLVError_Unknown);
    tlv_free(message);
    return;
  }

  switch(tlv_get_integer_value(message, TLVType_Method, -1))
  {
    case TLVMethod_AddPairing:
      {
        CLIENT_INFO(context, "Add Pairing");

        if(!(context->permissions & pairing_permissions_admin))
        {
          CLIENT_ERROR(context, "Refusing to add pairing to non-admin controller");
          send_tlv_error_response(context, 2, TLVError_Authentication);
          break;
        }

        tlv_t* tlv_device_identifier = tlv_get_value(message, TLVType_Identifier);
        if(!tlv_device_identifier)
        {
          CLIENT_ERROR(context, "Invalid add pairing request: no device identifier");
          send_tlv_error_response(context, 2, TLVError_Unknown);
          break;
        }
        tlv_t* tlv_device_public_key = tlv_get_value(message, TLVType_PublicKey);
        if(!tlv_device_public_key)
        {
          CLIENT_ERROR(context, "Invalid add pairing request: no device public key");
          send_tlv_error_response(context, 2, TLVError_Unknown);
          break;
        }
        int device_permissions = tlv_get_integer_value(message, TLVType_Permissions, -1);
        if(device_permissions == -1)
        {
          CLIENT_ERROR(context, "Invalid add pairing request: no device permissions");
          send_tlv_error_response(context, 2, TLVError_Unknown);
          break;
        }

        ed25519_key device_key;
        crypto_ed25519_init(&device_key);
        r = crypto_ed25519_import_public_key(&device_key, tlv_device_public_key->value,
          tlv_device_public_key->size);
        if(r)
        {
          CLIENT_ERROR(context, "Failed to import device public key");
          send_tlv_error_response(context, 2, TLVError_Unknown);
          break;
        }

        char* device_identifier = strndup((const char*)tlv_device_identifier->value,
          tlv_device_identifier->size);

        pairing_t pairing;
        if(!homekit_storage_find_pairing(device_identifier, &pairing))
        {
          size_t pairing_public_key_size = 0;
          crypto_ed25519_export_public_key(&pairing.device_key, NULL, &pairing_public_key_size);

          byte* pairing_public_key = (byte*)malloc(pairing_public_key_size);
          r = crypto_ed25519_export_public_key(&pairing.device_key, pairing_public_key,
            &pairing_public_key_size);
          if(r)
          {
            CLIENT_ERROR(context,
              "Failed to add pairing: error exporting pairing public key (code %d)", r);
            free(pairing_public_key);
            free(device_identifier);
            send_tlv_error_response(context, 2, TLVError_Unknown);
          }

          if(pairing_public_key_size != tlv_device_public_key->size
            || memcmp(tlv_device_public_key->value, pairing_public_key,
              pairing_public_key_size))
          {
            CLIENT_ERROR(context,
              "Failed to add pairing: pairing public key differs from given one");
            free(pairing_public_key);
            free(device_identifier);
            send_tlv_error_response(context, 2, TLVError_Unknown);
          }

