HolgerBurkarth/HomeKit-ESP8266/src/arduino_homekit_server.cpp
          free(pairing_public_key);

          r = homekit_storage_update_pairing(device_identifier, device_permissions);
          if(r)
          {
            CLIENT_ERROR(context, "Failed to add pairing: storage error (code %d)", r);
            free(device_identifier);
            send_tlv_error_response(context, 2, TLVError_Unknown);
            break;
          }

          INFO("Updated pairing with %s", device_identifier);
        }
        else
        {
          if(!homekit_storage_can_add_pairing())
          {
            CLIENT_ERROR(context, "Failed to add pairing: max peers");
            free(device_identifier);
            send_tlv_error_response(context, 2, TLVError_MaxPeers);
            break;
          }

          r = homekit_storage_add_pairing(device_identifier, &device_key, device_permissions);
          if(r)
          {
            CLIENT_ERROR(context, "Failed to add pairing: storage error (code %d)", r);
            free(device_identifier);
            send_tlv_error_response(context, 2, TLVError_Unknown);
            break;
          }

          INFO("Added pairing with %s", device_identifier);

          HOMEKIT_NOTIFY_EVENT(context->server, HOMEKIT_EVENT_PAIRING_ADDED);
        }

        free(device_identifier);

        tlv_values_t* response = tlv_new();
        tlv_add_integer_value(response, TLVType_State, 1, 2);

        send_tlv_response(context, response);

        break;
      }
    case TLVMethod_RemovePairing:
      {
        CLIENT_INFO(context, "Remove Pairing");

        if(!(context->permissions & pairing_permissions_admin))
        {
          CLIENT_ERROR(context, "Refusing to remove pairing to non-admin controller");
          send_tlv_error_response(context, 2, TLVError_Authentication);
          break;
        }

        tlv_t* tlv_device_identifier = tlv_get_value(message, TLVType_Identifier);
        if(!tlv_device_identifier)
        {
          CLIENT_ERROR(context, "Invalid remove pairing request: no device identifier");
          send_tlv_error_response(context, 2, TLVError_Unknown);
          break;
        }

        char* device_identifier = strndup((const char*)tlv_device_identifier->value,
          tlv_device_identifier->size);

        pairing_t pairing;
        if(!homekit_storage_find_pairing(device_identifier, &pairing))
        {
          bool is_admin = pairing.permissions & pairing_permissions_admin;

          r = homekit_storage_remove_pairing(device_identifier);
          if(r)
          {
            CLIENT_ERROR(context, "Failed to remove pairing: storage error (code %d)", r);
            free(device_identifier);
            send_tlv_error_response(context, 2, TLVError_Unknown);
            break;
          }

          INFO("Removed pairing with %s", device_identifier);

          HOMEKIT_NOTIFY_EVENT(context->server, HOMEKIT_EVENT_PAIRING_REMOVED);

          client_context_t* c = context->server->clients;
          while(c)
          {
            if(c->pairing_id == pairing.id)
              c->disconnect = true;
            c = c->next;
          }

          if(is_admin)
          {
            // Removed pairing was admin,
            // check if there any other admins left.
            // If no admins left, enable pairing again
            bool admin_found = false;

            pairing_iterator_t pairing_it;
            homekit_storage_pairing_iterator_init(&pairing_it);
            while((!homekit_storage_next_pairing(&pairing_it, &pairing)))
            {
              if(pairing.permissions & pairing_permissions_admin)
              {
                admin_found = true;
                break;
              }
            };
            homekit_storage_pairing_iterator_done(&pairing_it);

            if(!admin_found)
            {
              // No admins left, enable pairing again
              INFO("Last admin pairing was removed, enabling pair setup");
              context->server->paired = false;
              //homekit_setup_mdns(context->server);
            }
          }
        }
        free(device_identifier);

        tlv_values_t* response = tlv_new();
        tlv_add_integer_value(response, TLVType_State, 1, 2);
        send_tlv_response(context, response);

        break;
      }
    case TLVMethod_ListPairings:
      {
        CLIENT_INFO(context, "List Pairings");

        if(!(context->permissions & pairing_permissions_admin))
        {
          CLIENT_INFO(context, "Refusing to list pairings to non-admin controller");
          send_tlv_error_response(context, 2, TLVError_Authentication);
          break;
        }

        tlv_values_t* response = tlv_new();
        tlv_add_integer_value(response, TLVType_State, 1, 2);

        bool first = true;

        pairing_iterator_t it;
        homekit_storage_pairing_iterator_init(&it);

        pairing_t pairing;

        byte public_key[32];

        while(!homekit_storage_next_pairing(&it, &pairing))
        {
          if(!first)
          {
            tlv_add_value(response, TLVType_Separator, NULL, 0);
          }
          size_t public_key_size = sizeof(public_key);
          r = crypto_ed25519_export_public_key(&pairing.device_key, public_key, &public_key_size);

          tlv_add_string_value(response, TLVType_Identifier, pairing.device_id);
          tlv_add_value(response, TLVType_PublicKey, public_key, public_key_size);
          tlv_add_integer_value(response, TLVType_Permissions, 1, pairing.permissions);

          first = false;
        }
        homekit_storage_pairing_iterator_done(&it);

        send_tlv_response(context, response);
        break;
      }
    default:
      {
        send_tlv_error_response(context, 2, TLVError_Unknown);
        break;
      }
  }

  tlv_free(message);
}

#pragma endregion

#pragma region homekit_server_on_reset
void homekit_server_on_reset(client_context_t* context)
{
  INFO("Reset HomeKit Server");

  homekit_server_reset();
  send_204_response(context);

  //vTaskDelay(3000 / portTICK_PERIOD_MS);

