HolgerBurkarth/HomeKit-ESP8266/src/arduino_homekit_server.cpp
  homekit_system_restart();
}

#pragma endregion

#pragma region homekit_server_on_resource
void homekit_server_on_resource(client_context_t* context)
{
  CLIENT_INFO(context, "Resource"); DEBUG_HEAP();

  if(!context->server->config->on_resource)
  {
    send_404_response(context);
    return;
  }

  context->server->config->on_resource(context->body, context->body_length);
}

#pragma endregion

#pragma region homekit_server_on_url
int homekit_server_on_url(http_parser* parser, const char* data, size_t length)
{
  client_context_t* context = (client_context_t*)parser->data;

  context->endpoint = HOMEKIT_ENDPOINT_UNKNOWN;
  if(parser->method == HTTP_PARSER_METHOD_GET)
  {
    if(!strncmp(data, "/accessories", length))
    {
      context->endpoint = HOMEKIT_ENDPOINT_GET_ACCESSORIES;
    }
    else
    {
      static const char url[] = "/characteristics";
      size_t url_len = sizeof(url) - 1;

      if(length >= url_len && !strncmp(data, url, url_len)
        && (data[url_len] == 0 || data[url_len] == '?'))
      {
        context->endpoint = HOMEKIT_ENDPOINT_GET_CHARACTERISTICS;
        if(data[url_len] == '?')
        {
          char* query = strndup(data + url_len + 1, length - url_len - 1);
          context->endpoint_params = query_params_parse(query);
          free(query);
        }
      }
    }
  }
  else if(parser->method == HTTP_PARSER_METHOD_POST)
  {
    if(!strncmp(data, "/identify", length))
    {
      context->endpoint = HOMEKIT_ENDPOINT_IDENTIFY;
    }
    else if(!strncmp(data, "/pair-setup", length))
    {
      context->endpoint = HOMEKIT_ENDPOINT_PAIR_SETUP;
    }
    else if(!strncmp(data, "/pair-verify", length))
    {
      context->endpoint = HOMEKIT_ENDPOINT_PAIR_VERIFY;
    }
    else if(!strncmp(data, "/pairings", length))
    {
      context->endpoint = HOMEKIT_ENDPOINT_PAIRINGS;
    }
    else if(!strncmp(data, "/resource", length))
    {
      context->endpoint = HOMEKIT_ENDPOINT_RESOURCE;
    }
  }
  else if(parser->method == HTTP_PARSER_METHOD_PUT)
  {
    if(!strncmp(data, "/characteristics", length))
    {
      context->endpoint = HOMEKIT_ENDPOINT_UPDATE_CHARACTERISTICS;
    }
  }

  if(context->endpoint == HOMEKIT_ENDPOINT_UNKNOWN)
  {
    char* url = strndup(data, length);
    //TODO fix
    //ERROR("Unknown endpoint: %s %s", http_method_str(parser->method), url);
    free(url);
  }

  return 0;
}

#pragma endregion

#pragma region homekit_server_on_body
int homekit_server_on_body(http_parser* parser, const char* data, size_t length)
{
  DEBUG("http_parser length=%d", length);
  client_context_t* context = (client_context_t*)parser->data;
  context->body = (char*)realloc(context->body, context->body_length + length + 1);
  memcpy(context->body + context->body_length, data, length);
  context->body_length += length;
  context->body[context->body_length] = 0;

  return 0;
}

#pragma endregion

#pragma region homekit_server_on_message_complete
int homekit_server_on_message_complete(http_parser* parser)
{
  DEBUG("http_parser message_complete");
  client_context_t* context = (client_context_t*)parser->data;

  if(!context->encrypted)
  {
    switch(context->endpoint)
    {
      case HOMEKIT_ENDPOINT_PAIR_SETUP:
        {
          homekit_server_on_pair_setup(context, (const byte*)context->body,
            context->body_length);
          break;
        }
      case HOMEKIT_ENDPOINT_PAIR_VERIFY:
        {
          homekit_server_on_pair_verify(context, (const byte*)context->body,
            context->body_length);
          break;
        }
      default:
        {
          DEBUG("Unknown endpoint");
          send_404_response(context);
          break;
        }
    }
  }
  else
  {
    switch(context->endpoint)
    {
      case HOMEKIT_ENDPOINT_IDENTIFY:
        {
          homekit_server_on_identify(context);
          break;
        }
      case HOMEKIT_ENDPOINT_GET_ACCESSORIES:
        {
          homekit_server_on_get_accessories(context);
          break;
        }
      case HOMEKIT_ENDPOINT_GET_CHARACTERISTICS:
        {
          homekit_server_on_get_characteristics(context);
          break;
        }
      case HOMEKIT_ENDPOINT_UPDATE_CHARACTERISTICS:
        {
          homekit_server_on_update_characteristics(context, (const byte*)context->body,
            context->body_length);
          break;
        }
      case HOMEKIT_ENDPOINT_PAIRINGS:
        {
          homekit_server_on_pairings(context, (const byte*)context->body, context->body_length);
          break;
        }
      case HOMEKIT_ENDPOINT_RESOURCE:
        {
          homekit_server_on_resource(context);
          break;
        }
      default:
        {
          DEBUG("Unknown endpoint");
          send_404_response(context);
          break;
        }
    }
  }

  if(context->endpoint_params)
  {
    query_params_free(context->endpoint_params);
    context->endpoint_params = NULL;
  }

  if(context->body)
  {
    free(context->body);
    context->body = NULL;
    context->body_length = 0;
  }
  return 0;
}

#pragma endregion

#pragma region make_http_parser_settings
http_parser_settings make_http_parser_settings()
{
  http_parser_settings settings;
  settings.on_url = homekit_server_on_url;
  settings.on_body = homekit_server_on_body;
  settings.on_message_complete = homekit_server_on_message_complete;
  return settings;
}

#pragma endregion

#pragma region homekit_http_parser_settings
//sorry, unimplemented: non-trivial designated initializers not supported
//static http_parser_settings homekit_http_parser_settings = {
//    .on_url = homekit_server_on_url,
//    .on_body = homekit_server_on_body,
//    .on_message_complete = homekit_server_on_message_complete,
//};
//struct A a={.b = 1,.c = 2}; //c++ compiler dose not support
//struct A a={b:1,c:2}；
static http_parser_settings homekit_http_parser_settings = make_http_parser_settings();

#pragma endregion

#pragma region homekit_client_process
void homekit_client_process(client_context_t* context)
{
  //    int data_len = read(
  //        context->socket,
  //        context->data+context->data_available,
  //        context->data_size-context->data_available
  //    );
  if(context->socket == nullptr)
  {
    CLIENT_ERROR(context, "The socket is null");
    return;
  }
  int data_len = 0;
  int available_len = context->socket->available();  // optimistic_yield(100);
  if(available_len > 0)
  {
    int size = context->data_size - context->data_available;
    if(size > available_len)
    {
      size = available_len;
    }
    // read or readBytes
    data_len = context->socket->read(context->data + context->data_available, size);
  }
  if(data_len == 0)
  {
    if(!context->socket->connected())
    {
      CLIENT_INFO(context, "Disconnected!");
      context->disconnect = true;
      homekit_server_close_client(context->server, context);
    }
    return;
  }
  CLIENT_DEBUG(context, "Got %d incoming data, encrypted is %s",
    data_len, context->encrypted ? "true" : "false");
  byte* payload = (byte*)context->data;
  size_t payload_size = (size_t)data_len;

