HolgerBurkarth/HomeKit-ESP8266/src/arduino_homekit_server.cpp
  byte* decrypted = NULL;
  size_t decrypted_size = 0;

  if(context->encrypted)
  {
    CLIENT_DEBUG(context, "Decrypting data");

    client_decrypt_(context, context->data, data_len, NULL, &decrypted_size);

    decrypted = (byte*)malloc(decrypted_size);
    int r = client_decrypt_(context, context->data, data_len, decrypted, &decrypted_size);

    if(r < 0)
    {
      CLIENT_ERROR(context, "Invalid client data");
      free(decrypted);
      return;
    }
    context->data_available = data_len - r;
    if(r && context->data_available)
    {
      memmove(context->data, &context->data[r], context->data_available);
    }
    CLIENT_DEBUG(context, "Decrypted %d bytes, available %d", decrypted_size, context->data_available);

    payload = decrypted;
    payload_size = decrypted_size;
    if(payload_size)
      print_binary("Decrypted data", payload, payload_size);
  }
  else
  {
    context->data_available = 0;
  }

  current_client_context = context;
  http_parser_execute(&context->parser, &homekit_http_parser_settings,
    (char*)payload, payload_size);
  current_client_context = NULL;

  CLIENT_DEBUG(context, "Finished processing");

  if(decrypted)
  {
    free(decrypted);
  }
}

#pragma endregion

#pragma region homekit_server_close_client
void homekit_server_close_client(homekit_server_t* server, client_context_t* context)
{
  CLIENT_INFO(context, "Closing client connection");
  context->step = HOMEKIT_CLIENT_STEP_END;
  server->nfds--;

  LockWebServer(false);

  if(context->socket)
  {
    context->socket->stop();
    CLIENT_DEBUG(context, "The socket is stopped");
    delete context->socket;
    context->socket = nullptr;
  }
  if(context->server->pairing_context && context->server->pairing_context->client == context)
  {
    pairing_context_free(context->server->pairing_context);
    context->server->pairing_context = NULL;
    CLIENT_INFO(context, "Clear the pairing context");
  }

  if(context->server->clients == context)
  {
    context->server->clients = context->next;
  }
  else
  {
    client_context_t* c = context->server->clients;
    while(c->next && c->next != context)
      c = c->next;
    if(c->next)
      c->next = c->next->next;
  }

  homekit_accessories_clear_notify_callbacks(context->server->config->accessories,
    client_notify_characteristic, context);

  HOMEKIT_NOTIFY_EVENT(server, HOMEKIT_EVENT_CLIENT_DISCONNECTED);

  client_context_free(context);
}

#pragma endregion

#pragma region homekit_server_accept_client
client_context_t* homekit_server_accept_client(homekit_server_t* server)
{
  if(!server->wifi_server)
  {
    ERROR("The server's WiFiServer is NULL!");
    return NULL;
  }
  WiFiClient* wifiClient = nullptr;

  if(server->wifi_server->hasClient())
  {
    wifiClient = new WiFiClient(server->wifi_server->available());
    if(server->nfds >= HOMEKIT_MAX_CLIENTS)
    {
      WARN("No more room for client connections (max %d)", HOMEKIT_MAX_CLIENTS);
      wifiClient->stop();
      delete wifiClient;
      return NULL;
    }
  }
  else
  {
    return NULL;
  }

  INFO("Got new client: local %s:%d, remote %s:%d",
    wifiClient->localIP().toString().c_str(), wifiClient->localPort(),
    wifiClient->remoteIP().toString().c_str(), wifiClient->remotePort());

  LockWebServer(true);

  wifiClient->keepAlive
  (
    HOMEKIT_SOCKET_KEEPALIVE_IDLE_SEC,
    HOMEKIT_SOCKET_KEEPALIVE_INTERVAL_SEC,
    HOMEKIT_SOCKET_KEEPALIVE_IDLE_COUNT
  );
  wifiClient->setNoDelay(true);
  wifiClient->setSync(false);
  wifiClient->setTimeout(HOMEKIT_SOCKET_TIMEOUT);

  client_context_t* context = client_context_new(wifiClient);
  context->server = server;
  context->socket = wifiClient;

  context->next = server->clients;
  server->clients = context;

  server->nfds++;

  HOMEKIT_NOTIFY_EVENT(server, HOMEKIT_EVENT_CLIENT_CONNECTED);

  return context;
}

#pragma endregion

#pragma region homekit_server_process_notifications
//iPhone characteristic
void homekit_server_process_notifications(homekit_server_t* server)
{
  client_context_t* context = server->clients;
  // haracteristic_event_t client_event_t
  // Apple，Notify
  while(context)
  {
    if(context->step != HOMEKIT_CLIENT_STEP_PAIR_VERIFY_2OF2)
    {
      // Do not send event when the client is not verify over.
      context = context->next;
      continue;
    }
    characteristic_event_t* event = NULL;
    if(context->event_queue && q_pop(context->event_queue, &event))
    {
      // Get and coalesce all client events
      client_event_t* events_head = (client_event_t*)malloc(sizeof(client_event_t));
      events_head->characteristic = event->characteristic;
      homekit_value_copy(&events_head->value, &event->value);
      events_head->next = NULL;

      homekit_value_destruct(&event->value);
      free(event);

      client_event_t* events_tail = events_head;

      while(q_pop(context->event_queue, &event))
      {
        //event = context->event_queue->shift();
        client_event_t* e = events_head;
        while(e)
        {
          if(e->characteristic == event->characteristic)
          {
            break;
          }
          e = e->next;
        }

        if(e)
        {
          homekit_value_destruct(&e->value);
        }
        else
        {
          e = (client_event_t*)malloc(sizeof(client_event_t));
          e->characteristic = event->characteristic;
          e->next = NULL;

          events_tail->next = e;
          events_tail = e;
        }

        homekit_value_copy(&e->value, &event->value);

        homekit_value_destruct(&event->value);
        free(event);
      }

      send_client_events(context, events_head);

      client_event_t* e = events_head;
      while(e)
      {
        client_event_t* next = e->next;

        homekit_value_destruct(&e->value);
        free(e);

        e = next;
      }
    }

    context = context->next;
  }

}

#pragma endregion

#pragma region homekit_client_need_process_data
bool homekit_client_need_process_data(client_context_t* context)
{
  if(context)
  {
    return (context->step >= HOMEKIT_CLIENT_STEP_PAIR_SETUP_1OF3
      && context->step < HOMEKIT_CLIENT_STEP_PAIR_VERIFY_2OF2);
  }
  return false;
}

#pragma endregion

#pragma region homekit_server_process
//run in loop, include {accept_client, client_process, notifications}
void homekit_server_process(homekit_server_t* server)
{

  homekit_server_accept_client(server);

