HolgerBurkarth/HomeKit-ESP8266/src/arduino_homekit_server.cpp
  client_context_t* context = server->clients;
  while(context)
  {
    //homekit_client_process includes {handle data and stop disconnected client}
//      do{
//          if(homekit_client_need_process_data(context)){
//              CLIENT_INFO(context, "Step is %d", context->step);
//          }
//          delay(10);
    homekit_client_process(context);
    //      } while(homekit_client_need_process_data(context));

    context = context->next;
  }
  homekit_server_process_notifications(server);
}

#pragma endregion

#pragma region homekit_mdns_init
void homekit_mdns_init(homekit_server_t* server)
{
  if(!WiFi.isConnected())
  {
    return;
  }

  VERBOSE("Configuring MDNS");

  IPAddress staIP = WiFi.localIP();
  if(!staIP.isSet())
  {
    return;
  }

  homekit_accessory_t* accessory = const_cast<homekit_accessory_t*>(server->config->accessories[0]);
  homekit_service_t* accessory_info = homekit_service_by_type(accessory, HOMEKIT_SERVICE_ACCESSORY_INFORMATION);
  if(!accessory_info)
  {
    ERROR("Invalid accessory declaration: no Accessory Information service");
    return;
  }

  homekit_characteristic_t* name = homekit_service_characteristic_by_type(accessory_info,
    HOMEKIT_CHARACTERISTIC_NAME);
  if(!name)
  {
    ERROR("Invalid accessory declaration: " "no Name characteristic in AccessoryInfo service");
    return;
  }

  homekit_characteristic_t* model = homekit_service_characteristic_by_type(accessory_info,
    HOMEKIT_CHARACTERISTIC_MODEL);
  if(!model)
  {
    ERROR("Invalid accessory declaration: " "no Model characteristic in AccessoryInfo service");
    return;
  }

  if(homekit_mdns_started)
  {
    MDNS.close();
    MDNS.begin(name->value.string_value, staIP);
    INFO("MDNS restart: %s, IP: %s", name->value.string_value, staIP.toString().c_str());
    MDNS.announce();
    return;
  }

  //homekit_mdns_configure_init(name->value.string_value, PORT);
  WiFi.hostname(name->value.string_value);
  // Must specify the MDNS runs on the IP of STA
  MDNS.begin(name->value.string_value, staIP);
  INFO("MDNS begin: http://%s.local, IP: %s", name->value.string_value, staIP.toString().c_str());

  MDNSResponder::hMDNSService mdns_service = MDNS.addService(name->value.string_value,
    HOMEKIT_MDNS_SERVICE, HOMEKIT_MDNS_PROTO, HOMEKIT_SERVER_PORT);
  // Set a service specific callback for dynamic service TXT items.
  // The callback is called, whenever service TXT items are needed for the given service.
  MDNS.setDynamicServiceTxtCallback
  (
    mdns_service,
    [](const MDNSResponder::hMDNSService p_hService)
    {
      DEBUG("MDNS call DynamicServiceTxtCallback");
      if(running_server)
      {
        MDNS.addDynamicServiceTxt(p_hService, "sf",
          (running_server->paired) ? "0" : "1");
        MDNS.addDynamicServiceTxt(p_hService, "c#",
          running_server->config->config_number);
      }

    }
  );
  MDNS.addServiceTxt(mdns_service, "md", model->value.string_value);
  MDNS.addServiceTxt(mdns_service, "pv", "1.0");
  MDNS.addServiceTxt(mdns_service, "id", server->accessory_id);

  //"c#" is a DynamicServiceTxt
  //Current configuration number. Required.
  //Must update when an accessory, service, or characteristic is added or removed on the accessory server.
  //Accessories must increment the config number after a firmware update.
  //This must have a range of 1-65535 and wrap to 1 when it overflows.
  //This value must persist across reboots, power cycles, etc.
  //MDNS.addServiceTxt(mdns_service, "c#", String(server->config->config_number).c_str());
  MDNS.addServiceTxt(mdns_service, "s#", "1");
  MDNS.addServiceTxt(mdns_service, "ff", "0");
  //"sf" is a DynamicServiceTxt
  //MDNS.addServiceTxt(HAP_SERVICE, HOMEKIT_MDNS_PROTO, "sf", (server->paired) ? "0" : "1");
  MDNS.addServiceTxt(mdns_service, "ci", String(server->config->category).c_str());

  /*
   // accessory model name (required)
   homekit_mdns_add_txt("md", "%s", model->value.string_value);
   // protocol version (required)
   homekit_mdns_add_txt("pv", "1.0");
   // device ID (required)
   // should be in format XX:XX:XX:XX:XX:XX, otherwise devices will ignore it
   homekit_mdns_add_txt("id", "%s", server->accessory_id);
   // current configuration number (required)
   homekit_mdns_add_txt("c#", "%d", server->config->config_number);
   // current state number (required)
   homekit_mdns_add_txt("s#", "1");
   // feature flags (required if non-zero)
   //   bit 0 - supports HAP pairing. required for all HomeKit accessories
   //   bits 1-7 - reserved
   homekit_mdns_add_txt("ff", "0");
   // status flags
   //   bit 0 - not paired
   //   bit 1 - not configured to join WiFi
   //   bit 2 - problem detected on accessory
   //   bits 3-7 - reserved
   homekit_mdns_add_txt("sf", "%d", (server->paired) ? 0 : 1);
   // accessory category identifier
   homekit_mdns_add_txt("ci", "%d", server->config->category);*/

  if(server->config->setupId)
  {
    DEBUG("Accessory Setup ID = %s", server->config->setupId);

    size_t data_size = strlen(server->config->setupId) + strlen(server->accessory_id) + 1;
    char* data = (char*)malloc(data_size);
    snprintf(data, data_size, "%s%s", server->config->setupId, server->accessory_id);
    data[data_size - 1] = 0;

    unsigned char shaHash[SHA512_DIGEST_SIZE];
    wc_Sha512Hash((const unsigned char*)data, data_size - 1, shaHash);

    free(data);

    unsigned char encodedHash[9];
    memset(encodedHash, 0, sizeof(encodedHash));
    word32 len = sizeof(encodedHash);
    base64_encode_((const unsigned char*)shaHash, 4, encodedHash);
    MDNS.addServiceTxt(mdns_service, "sh", (char*)encodedHash);
  }

  MDNS.announce();
  MDNS.update();
  homekit_mdns_started = true;
  //INFO("MDNS OK! Open your \"Home\" app, click \"Add or Scan Accessory\""
  //        " and \"I Don't Have a Code\". \nThis Accessory will show on your iOS device.");
}

#pragma endregion

#pragma region homekit_update_config_number
// Used to update the config_number ("c#" value of Bonjour)
// Call this function when an accessory, service, or characteristic is added or removed on the accessory server.
// See the official HAP specification for more information.
void homekit_update_config_number()
{
  if(!homekit_mdns_started)
  {
    return;
  }
  if(!running_server)
  {
    return;
  }
  // range of 1-65535
  uint16_t c = running_server->config->config_number;
  if(c == 0)
    ERROR("config_number is 0, please check and retry");
  //c = (c > 0 && c < 65535) ? (c + 1) : 1;
  //running_server->config->config_number = c;

  MDNS.announce();
  MDNS.update();
  INFO("Update config_number to %u", c);
}

#pragma endregion

#pragma region homekit_accessory_id_generate
int homekit_accessory_id_generate(char* accessory_id)
{
  byte buf[6];
  homekit_random_fill(buf, sizeof(buf));

  snprintf(accessory_id, ACCESSORY_ID_SIZE + 1, "%02X:%02X:%02X:%02X:%02X:%02X", buf[0], buf[1],
    buf[2], buf[3], buf[4], buf[5]);

  INFO("Generated new accessory ID: %s", accessory_id);
  return 0;
}

#pragma endregion

