HolgerBurkarth/HomeKit-ESP8266/src/arduino_homekit_server.cpp
#pragma region homekit_accessory_key_generate
int homekit_accessory_key_generate(ed25519_key* key)
{
  int r = crypto_ed25519_generate(key);
  if(r)
  {
    ERROR("Failed to generate accessory key");
    return r;
  }

  INFO("Generated new accessory key");

  return 0;
}

#pragma endregion

#pragma region homekit_server_init
void homekit_server_init(const homekit_server_config_t* config)
{
  if(!config->accessories)
  {
    ERROR("Error initializing HomeKit accessory server: "
      "accessories are not specified");
    return;
  }

  if(!config->password && !config->password_callback)
  {
    ERROR("Error initializing HomeKit accessory server: "
      "neither password nor password callback is specified");
    return;
  }

  if(config->password)
  {
    const char* p = config->password;
    if(strlen(p) != 10
      || !(ISDIGIT(p[0]) && ISDIGIT(p[1]) && ISDIGIT(p[2]) && p[3] == '-' && ISDIGIT(p[4])
        && ISDIGIT(p[5]) && p[6] == '-' && ISDIGIT(p[7]) && ISDIGIT(p[8])
        && ISDIGIT(p[9])))
    {
      ERROR("Error initializing HomeKit accessory server: " "invalid password format");
      return;
    }
  }

  if(config->setupId)
  {
    const char* p = config->setupId;
    if(strlen(p) != 4
      || !(ISBASE36(p[0]) && ISBASE36(p[1]) && ISBASE36(p[2]) && ISBASE36(p[3])))
    {
      ERROR("Error initializing HomeKit accessory server: " "invalid setup ID format");
      return;
    }
  }

  homekit_accessories_init(config->accessories);
  if(config->config_number == 0)
  {
    ERROR("Error initializing HomeKit accessory server: config_number is not specified");
    //config->config_number = config->accessories[0]->config_number;
    //if(!config->config_number)
    //{
    //  config->config_number = 1;
    //}
  }
  if(!config->category)
  {
    ERROR("Error initializing HomeKit accessory server: category is not specified");
    //config->category = config->accessories[0]->category;
  }
  homekit_server_t* server = server_new();
  running_server = server;
  server->config = config;

  //homekit_server_task(server);
  VERBOSE("Starting server");

  int r = homekit_storage_init();
  if(r == 0)
  {
    r = homekit_storage_load_accessory_id(server->accessory_id);

    if(!r)
      r = homekit_storage_load_accessory_key(&server->accessory_key);
  }

  if(r)
  {
    if(r < 0)
    {
      INFO("Resetting HomeKit storage");
      homekit_storage_reset();
    }

    homekit_accessory_id_generate(server->accessory_id);
    homekit_storage_save_accessory_id(server->accessory_id);

    homekit_accessory_key_generate(&server->accessory_key);
    homekit_storage_save_accessory_key(&server->accessory_key);
  }
  else
  {
    INFO("Using existing accessory ID: %s", server->accessory_id);
  }

  pairing_iterator_t pairing_it;
  homekit_storage_pairing_iterator_init(&pairing_it);

  pairing_t pairing;
  while(!homekit_storage_next_pairing(&pairing_it, &pairing))
  {
    if(pairing.permissions & pairing_permissions_admin)
    {
      INFO("Found admin pairing with %s, disabling pair setup", pairing.device_id);
      server->paired = true;
      break;
    }
  }
  homekit_storage_pairing_iterator_done(&pairing_it);

  if(!server->paired)
  {
    if(!arduino_homekit_preinit(server))
    {
      ERROR("Error in arduino_homekit_preinit, please check and retry");
      system_restart();
      return;
    }
  }

  homekit_mdns_init(server);
  HOMEKIT_NOTIFY_EVENT(server, HOMEKIT_EVENT_SERVER_INITIALIZED);
  homekit_server_process(server);

  VERBOSE("Init server done");
}

#pragma endregion

#pragma region homekit_server_reset
void homekit_server_reset()
{
  homekit_storage_reset();
}

#pragma endregion

#pragma region homekit_is_paired
bool homekit_is_paired()
{
  bool paired = false;

  pairing_iterator_t pairing_it;
  homekit_storage_pairing_iterator_init(&pairing_it);

  pairing_t pairing;
  while(!homekit_storage_next_pairing(&pairing_it, &pairing))
  {
    if(pairing.permissions & pairing_permissions_admin)
    {
      paired = true;
      break;
    }
  };
  homekit_storage_pairing_iterator_done(&pairing_it);

  return paired;
}

#pragma endregion

#pragma region homekit_get_accessory_id
int homekit_get_accessory_id(char* buffer, size_t size)
{
  if(size < ACCESSORY_ID_SIZE + 1)
    return -1;

  int r = homekit_storage_load_accessory_id(buffer);
  if(r)
    return r;

  return 0;
}

#pragma endregion

#pragma region homekit_get_setup_uri
int homekit_get_setup_uri(const homekit_server_config_t* config, char* buffer, size_t buffer_size)
{
  static const char base36Table[] = "0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ";

  if(buffer_size < 20)
    return -1;

  if(!config->password)
    return -1;
  // TODO: validate password in case it is run before server is started

  if(!config->setupId)
    return -1;
  // TODO: validate setupID in case it is run before server is started

  homekit_accessory_t* accessory = homekit_accessory_by_id(config->accessories, 1);
  if(!accessory)
    return -1;

  uint32_t setup_code = 0;
  for(const char* s = config->password; *s; s++)
  {
    if(ISDIGIT(*s))
    {
      setup_code = setup_code * 10 + *s - '0';
    }
  }

  uint64_t payload = 0;

  payload <<= 4;  // reserved 4 bits

  payload <<= 8;
  payload |= accessory->category & 0xff;

  payload <<= 4;
  payload |= 2;  // flags (2=IP, 4=BLE, 8=IP_WAC)

  payload <<= 27;
  payload |= setup_code & 0x7fffffff;

  strcpy(buffer, "X-HM://");
  buffer += 7;
  for(int i = 8; i >= 0; i--)
  {
    buffer[i] = base36Table[payload % 36];
    payload /= 36;
  }
  buffer += 9;

  strcpy(buffer, config->setupId);
  buffer += 4;

  buffer[0] = 0;

  return 0;
}

#pragma endregion

#pragma region arduino_homekit_preinit
// Pre-initialize the pairing_context used in Pair-Setup 1/3
// For avoiding timeout caused socket disconnection from iOS device.
bool arduino_homekit_preinit(homekit_server_t* server)
{
  if(saved_preinit_pairing_context != nullptr)
  {
    return true;
  }
  INFO("Preinitializing pairing context");
  pairing_context_t* preinit_pairing_context = pairing_context_new();
  DEBUG_HEAP();
  char password[11];
  if(server->config->password)
  {
    strncpy(password, server->config->password, sizeof(password));
    //CLIENT_DEBUG(context, "Using user-specified password: %s", password);
    INFO("Using user-specified password: %s", password);
  }
  else
  {
    for(int i = 0; i < 10; i++)
    {
      password[i] = homekit_random() % 10 + '0';
    }
    password[3] = password[6] = '-';
    password[10] = 0;
    //CLIENT_DEBUG(context, "Using random password: %s", password);
    INFO("Using random password: %s", password);
  }

  if(server->config->password_callback)
  {
    server->config->password_callback(password);
  }

  watchdog_disable_all();
  watchdog_check_begin();
  crypto_srp_init(preinit_pairing_context->srp, "Pair-Setup", password);
  watchdog_check_end("crypto_srp_init");  // 6585ms
  watchdog_enable_all();

  delay(10);

