HolgerBurkarth/HomeKit-ESP8266/src/arduino_homekit_server.cpp
  if(preinit_pairing_context->public_key)
  {
    free(preinit_pairing_context->public_key);
    preinit_pairing_context->public_key = NULL;
  }
  preinit_pairing_context->public_key_size = 0;
  crypto_srp_get_public_key(preinit_pairing_context->srp, NULL,
    &preinit_pairing_context->public_key_size);

  preinit_pairing_context->public_key = (byte*)malloc(preinit_pairing_context->public_key_size);

  watchdog_disable_all();
  watchdog_check_begin();
  int r = crypto_srp_get_public_key(preinit_pairing_context->srp,
    preinit_pairing_context->public_key, &preinit_pairing_context->public_key_size);
  watchdog_check_end("crypto_srp_get_public_key");  // 3310ms
  watchdog_enable_all();

  delay(10);

  if(r)
  {
    //CLIENT_ERROR(context, "Failed to dump SPR public key (code %d)", r);
    ERROR("Failed to dump SPR public key (code %d)");
    pairing_context_free(preinit_pairing_context);
    preinit_pairing_context = NULL;
    // In preinit, we should not send response
    // send_tlv_error_response(context, 2, TLVError_Unknown);
    return false;
  }
  saved_preinit_pairing_context = preinit_pairing_context;

  INFO("Preinitialize pairing context success");
  MDNS.announce();      // update "paired" state
  return true;
}

#pragma endregion

#pragma region arduino_homekit_setup
void arduino_homekit_setup(const homekit_server_config_t* config)
{
  if(system_get_cpu_freq() != SYS_CPU_160MHZ)
  {
    system_update_cpu_freq(SYS_CPU_160MHZ);
    VERBOSE("Update the CPU to run at 160MHz");
  }

  homekit_server_init(config);
  // The MDNS needs to be restarted when WiFi is connected to confirm the
  // MDNS runs at the IPAddress of STA
  // otherwise the iOS will not show the Accessory
  arduino_homekit_gotiphandler = WiFi.onStationModeGotIP([](WiFiEventStationModeGotIP gotip)
    {
      INFO("WiFi connected, IP: %s, mask: %s, gw: %s",
        gotip.ip.toString().c_str(), gotip.mask.toString().c_str(),
        gotip.gw.toString().c_str());
      if(running_server)
      {
        homekit_mdns_init(running_server);
      }
      else
      {
        ERROR("running_server is NULL!");
      }
    });
}

#pragma endregion

#pragma region arduino_homekit_loop
void arduino_homekit_loop()
{
  if(homekit_mdns_started)
  {
    MDNS.update();
  }
  if(running_server != nullptr)
  {
    if(!running_server->paired)
    {
      //If not paired or pairing was removed, preinit paring context.
      arduino_homekit_preinit(running_server);
    }
    homekit_server_process(running_server);
  }
}

#pragma endregion

#pragma region arduino_homekit_connected_clients_count
int arduino_homekit_connected_clients_count()
{
  if(running_server)
  {
    return running_server->nfds;
  }
  return -1;
}

#pragma endregion

#pragma region arduino_homekit_get_running_server
homekit_server_t* arduino_homekit_get_running_server()
{
  return running_server;
}

#pragma endregion
